class DhikrData {
  static const List<Map<String, dynamic>> dailyDhikrPackage = [
    {
      "packageName": "ইস্তেগফার বা ক্ষমা প্রার্থনার দোয়া",
      "description":
          "এটি অত্যন্ত শক্তিশালী এবং সুন্দর একটি ইস্তেগফার বা ক্ষমা প্রার্থনার দোয়া। এটি মূলত 'সাইয়্যিদুল ইস্তেগফারে'র মতো ছোট অথচ গভীর অর্থবহ একটি আমল।",
      "dhikrs": [
        {
          "title":
              "রাব্বিগ-ফিরলী ওয়া তুব 'আলাইয়্যা, ইন্নাকা আন্তাত-তাউওয়াবুর রাহীম।",
          "arabic":
              "رَبِّ اغْفِرْ لِي وَتُبْ عَلَيَّ إِنَّكَ أَنْتَ التَّوَّابُ الرَّحِيمُ",
          "meaning":
              "হে আমার প্রতিপালক! আমাকে ক্ষমা করুন এবং আমার তওবা কবুল করুন। নিশ্চয়ই আপনি তওবা কবুলকারী ও পরম দয়ালু।",
          "Fazilat":
              "রাসূল (সা.)-এর সুন্নাহ: আব্দুল্লাহ ইবনে উমর (রা.) বলেন, \"আমরা এক মজলিসে বসে গুনে দেখতাম যে, রাসুলুল্লাহ (সা.) এই দোয়াটি ১০০ বার পাঠ করতেন।",
          "ref": "[সুনানে আবু দাউদ ও তিরমিজি]",
          "target": "100"
        },
        {
          "title":
              "সাইয়্যিদুল ইস্তিগফার:\nআল্লাহুম্মা আন্তা রাব্বী লা-ইলাহা ইল্লা আন্তা। খালাকতানী ওয়া আনা আবদুকা, ওয়া আনা আলা আহদিকা ওয়া ওয়াদিকা মাস্তাতাতু। আউযুবিকা মিন শাররি মা সানাতু, আবূউ লাকা বিনি’মাতিকা আলাইয়্যা, ওয়া আবূউ লাকা বিযাম্বী। ফাগফিরলী, ফাইন্নাহূ লা ইয়াগফিরুয যুনূবা ইল্লা আন্তা।",
          "arabic":
              "اللَّهُمَّ أَنْتَ رَبِّي لَا إِلَهَ إِلَّا أَنْتَ، خَلَقْتَنِي وَأَنَا عَبْدُكَ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ، وَأَبُوءُ لَكَ بِذَنْبِي فَاغْفِرْ لِي، فَإِنَّهُ لَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ",
          "meaning":
              "হে আল্লাহ! আপনিই আমার প্রতিপালক। আপনি ছাড়া কোনো উপাস্য নেই। আপনিই আমাকে সৃষ্টি করেছেন এবং আমি আপনার গোলাম। আমি আপনার কাছে দেওয়া অঙ্গীকার ও প্রতিশ্রুতির ওপর যথাসাধ্য কায়েম আছি। আমি আমার কৃতকর্মের অনিষ্ট থেকে আপনার কাছে আশ্রয় চাই। আমার ওপর আপনার দেওয়া নিয়ামতসমূহ স্বীকার করছি এবং আমার গুনাহসমূহও স্বীকার করছি। অতএব আমাকে ক্ষমা করুন, কারণ আপনি ছাড়া আর কেউ গুনাহ ক্ষমা করতে পারে না।",
          "Fazilat":
              "রাসুলুল্লাহ (সা.) বলেছেন, যে ব্যক্তি দিনের বেলা দৃঢ় বিশ্বাসের সাথে এই দোয়াটি পাঠ করবে এবং ঐদিন সন্ধ্যার আগেই মারা যাবে, সজান্নাতী হবে। আর যে ব্যক্তি রাতের বেলা বিশ্বাসের সাথে এটি পাঠ করবে এবং সকাল হওয়ার আগেই মারা যাবে, সেও জান্নাত হবে।",
          "ref": "[সহীহ বুখারী: ৬৩০৬]",
          "target": "1"
        },
        {
          "title":
              "আস্তাগফিরুল্লাহাল্লাযী লা ইলাহা ইল্লা হুওয়াল হাইয়্যুল কাইয়্যূমু ওয়া আতূবু ইলাইহি।",
          "arabic":
              "أَسْتَغْفِرُ اللَّهَ الَّذِي لَا إِلَهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ وَأَتُوبُ إِلَيْهِ",
          "meaning":
              "আমি সেই আল্লাহর কাছে ক্ষমা প্রার্থনা করছি, যিনি ছাড়া কোনো সত্য উপাস্য নেই। যিনি চিরঞ্জীব, অবিনশ্বর এবং আমি তাঁর কাছেই তওবা করছি।",
          "Fazilat":
              "নবীজি (সা.) বলেছেন, যে ব্যক্তি এই দোয়াটি পাঠ করবে, তাকে ক্ষমা করে দেওয়া হবে; যদিও সে রণক্ষেত্র থেকে পালিয়ে যাওয়ার মতো বড় অপরাধ (কবিরা গুনাহ) করে থাকে।",
          "ref": "[সুনানে আবু দাউদ ও তিরমিজি]",
          "target": "3"
        },
        {
          "title": "আস্তাগফিরুল্লাহ ওয়া আতূবু ইলাইহি।",
          "arabic": "أَسْتَغْفِرُ اللهَ وَأَتُوبُ إِلَيْهِ",
          "meaning":
              "আমি আল্লাহর নিকট ক্ষমা প্রার্থনা করছি এবং তাঁরই দিকে ফিরে আসছি (তওবা করছি)।",
          "Fazilat":
              "যে ব্যক্তি নিয়মিত ইস্তিগফার করে, আল্লাহ তাকে সব সংকীর্ণতা থেকে বের হওয়ার পথ করে দেন এবং অভাবনীয় উৎস থেকে রিযিক দান করেনবীজি (সা.) নিষ্পাপ হওয়া সত্ত্বেও প্রতিদিন ১০০ বার এই বাক্যটি পাঠ করে তওবা করতেন। ",
          "ref": "[সহীহ মুসলিম, আবু দাউদ]",
          "target": "100"
        },
        {
          "title":
              "আল্লাহুম্মা ইন্নী যলামতু নাফসী যুলমান কাসীরাও ওয়ালা ইয়াগফিরুয যুনূবা ইল্লা আনতা, ফাগফিরলী মাগফিরাতাম মিন ইনদিকা ওয়ারহামনী, ইন্নাকা আনতাল গাফুরুর রাহীম।",
          "arabic":
              "اللَّهُمَّ إِنِّي ظَلَمْتُ نَفْسِي ظُلْمًا كَثِيرًا، وَلَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ، فَاغْفِرْ لِي مَغْفِرَةً مِنْ عِنْدِكَ، وَارْحَمْنِي إِنَّكَا أَنْتَ الْغَفُورُ الرَّحِيمُ",
          "meaning":
              "হে আল্লাহ! আমি আমার নিজের ওপর অনেক জুলুম করেছি। আর আপনি ছাড়া গুনাহ ক্ষমা করার আর কেউ নেই। অতএব আপনার পক্ষ থেকে আমাকে ক্ষমা করুন এবং আমার ওপর দয়া করুন। নিশ্চয়ই আপনি পরম ক্ষমাশীল ও অতি দয়ালু।",
          "Fazilat":
              "হযরত আবু বকর (রা.) যখন নবীজি (সা.)-এর কাছে এমন একটি দোয়া চাইলেন যা তিনি নামাজে পড়তে পারেন, তখন নবীজি (সা.) এই দোয়াটি শিখিয়েছিলেন।",
          "ref": "[সহীহ বুখারী ও মুসলিম]",
          "target": "1"
        },
        {
          "title":
              "আস্তাগফিরুল্লাহা রাব্বি মিন কুল্লি জাম্বিওঁ ওয়া আতুবু ইলাইহি।",
          "arabic":
              "أَسْتَغْفِرُ اللهَ رَبِّي مِنْ كُلِّ ذَنْبٍ وَأَتُوبُ إِلَيْهِ",
          "meaning":
              "আমি আমার প্রতিপালক আল্লাহর কাছে আমার সকল গুনাহ থেকে ক্ষমা প্রার্থনা করছি এবং তাঁরই দিকে ফিরে আসছি (তওবা করছি)।",
          "Fazilat":
              "যারা নিয়মিত আল্লাহর কাছে ক্ষমা চায়, আল্লাহ তাদের ওপর থেকে আজাব ও গজব সরিয়ে নেন এবং তাদের দোয়া দ্রুত কবুল করেন।",
          "ref": "Unknown",
          "target": "10"
        }
      ]
    },
    {
      "packageName": "তাওহীদের শ্রেষ্ঠ জিকির",
      "description":
          "রাসূলুল্লাহ (সা.) বলেছেন, যে ব্যক্তি দিনে ১০০ বার এই জিকিরটি পড়বে,  সে ১০টি গোলাম আজাদ করার সমান সওয়াব পাবে।",
      "dhikrs": [
        {
          "title":
              "লা ইলাহা ইল্লাল্লাহু ওয়াহদাহু লা শারীকা লাহু, লাহুল মুলকু ওয়া লাহুল হামদু, ওয়া হুয়া আলা কুল্লি শাঈ’ইন ক্বাদীর।",
          "arabic":
              "لَا إِلَهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ",
          "meaning":
              "আল্লাহ ছাড়া কোনো উপাস্য নেই, তিনি একক, তাঁর কোনো শরিক নেই। রাজত্ব একমাত্র তাঁরই এবং সমস্ত প্রশংসা একমাত্র তাঁরই। তিনি সকল কিছুর ওপর ক্ষমতাবান।",
          "Fazilat":
              "রাসূলুল্লাহ (সা.) বলেছেন, আরাফাতের দিনে শ্রেষ্ঠ দোয়া হলো এটি।প্রতি ফরজ নামাজের পর এটি ১ বার পাঠ করা অত্যন্ত গুরুত্বপূর্ণ সুন্নাহ। ",
          "ref": "[সহীহ বুখারী ও মুসলিম]",
          "target": "10"
        },
        {
          "title": "ইয়া বাদী-উস সামাওয়াতি ওয়াল আরদ।",
          "arabic": "يَا بَدِيعَ السَّمَاوَاتِ وَالْأَرْضِ",
          "meaning":
          "হে আসমান ও জমিনের অপূর্ব স্রষ্টা (যিনি কোনো নমুনা ছাড়াই সবকিছু সৃষ্টি করেছেন)।",
          "Fazilat":
          "যদি কোনো ব্যক্তি অত্যন্ত কঠিন কোনো সমস্যার সম্মুখীন হয় এবং তার কোনো সমাধান খুঁজে না পায়, তবে ১০০০ বার 'ইয়া বাদী-উস সামাওয়াতি ওয়াল আরদ' পাঠ করলে আল্লাহ তার জন্য সমাধানের পথ সহজ করে দেন।",
          "ref": "",
          "target": "1000"
        }
      ]
    },
    {
      "packageName": "দরুদ শরীফ",
      "description":
          "পৃথিবীর সর্বশ্রেষ্ঠ মানব হযরত মুহাম্মদ (সা.)-এর প্রতি সম্মান ও ভালোবাসা প্রদর্শনের অন্যতম শ্রেষ্ঠ মাধ্যম",
      "dhikrs": [
        {
          "title": "সল্লাল্লাহু আলাইহি ওয়া সাল্লাম।",
          "arabic": "صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
          "meaning": "আল্লাহ তাঁর (রাসূলের) ওপর শান্তি ও রহমত বর্ষণ করুন।",
          "Fazilat":
              "রাসুলুল্লাহ (সা.) বলেছেন, যে ব্যক্তি আমার ওপর একবার দরুদ পাঠ করবে, আল্লাহ তার ওপর ১০টি রহমত বর্ষণ করবেন।",
          "ref": "[সহীহ মুসলিম]",
          "target": "10"
        },
        {
          "title": "আল্লাহুম্মা সল্লি ওয়া সাল্লিম 'আলা নাবিয়্যিনা মুহাম্মাদ।",
          "arabic": "اللَّهُمَّ صَلِّ وَسَلِّمْ عَلَى نَبِيِّنَا مُحَمَّدٍ",
          "meaning":
              "হে আল্লাহ! আপনি আমাদের নবী মুহাম্মাদ (সা.)-এর ওপর রহমত ও শান্তি বর্ষণ করুন।",
          "Fazilat":
              "রাসূলুল্লাহ (সা.) বলেছেন, যে ব্যক্তি সকালে ১০ বার এবং সন্ধ্যায় ১০ বার আমার ওপর দরুদ পাঠ করবে, কিয়ামতের দিন সে আমার শাফায়াত (সুপারিশ) লাভ করবে।",
          "ref": "[তাবারানি]",
          "target": "10"
        },
        {
          "title":
              "আল্লাহুম্মা সল্লি 'আলা মুহাম্মাদিউঁ ওয়া 'আলা আলি মুহাম্মাদ।",
          "arabic": "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ",
          "meaning":
              "হে আল্লাহ! আপনি মুহাম্মাদ (সা.) এবং তাঁর পরিবার-পরিজনের ওপর রহমত বর্ষণ করুন।",
          "Fazilat":
              "এই দরুদের বিশেষত্ব হলো এতে শুধু নবীজি (সা.) নন, বরং তাঁর পরিবারকেও শামিল করা হয়েছে। এটি পাঠ করলে নবীপ্রেমের সাথে সাথে তাঁর পরিবারের প্রতি ভালোবাসার বহিঃপ্রকাশ ঘটে।",
          "ref": "",
          "target": "10"
        },
        {
          "title":
              "দরুদে ইব্রাহিমঃ \nআল্লাহুম্মা সাল্লি আলা মুহাম্মাদিঁউ ওয়া আলা আলি মুহাম্মাদিন, কামা সাল্লাইতা আলা ইব্রাহীমা ওয়া আলা আলি ইব্রাহীমা ইন্নাকা হামীদুম মাজীদ। আল্লাহুম্মা বারিক আলা মুহাম্মাদিঁউ ওয়া আলা আলি মুহাম্মাদিন, কামা বারাকতা আলা ইব্রাহীমা ওয়া আলা আলি ইব্রাহীমা ইন্নাকা হামীদুম মাজীদ।",
          "arabic":
              "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ، اللَّهُمَّ بَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ",
          "meaning":
              "হে আল্লাহ! মুহাম্মদ (সা.) ও তাঁর বংশধরদের ওপর রহমত বর্ষণ করুন, যেমন রহমত বর্ষণ করেছেন ইব্রাহিম (আ.) ও তাঁর বংশধরদের ওপর। নিশ্চয়ই আপনি প্রশংসিত ও সম্মানিত। হে আল্লাহ! মুহাম্মদ (সা.) ও তাঁর বংশধরদের ওপর বরকত নাজিল করুন, যেমন বরকত নাজিল করেছেন ইব্রাহিম (আ.) ও তাঁর বংশধরদের ওপর। নিশ্চয়ই আপনি প্রশংসিত ও সম্মানিত।",
          "Fazilat":
              "যে ব্যক্তি বেশি বেশি দরুদ পাঠ করবে, কিয়ামতের দিন সে নবীজি (সা.)-এর সবচেয়ে নিকটবর্তী হবে।",
          "ref": "[তিরমিযী]",
          "target": "10"
        }
      ]
    },
    {
      "packageName": "সকাল-সন্ধ্যার জিকির",
      "description":
          "মুমিনের জন্য এক শক্তিশালী হাতিয়ার। ঘোর বিপদে বা দুশ্চিন্তার সময় আল্লাহর ওপর পূর্ণ ভরসা রাখার এটি শ্রেষ্ঠ ঘোষণা।",
      "dhikrs": [
        {
          "title": "হাসবুনাল্লাহু ওয়া নিমাল ওয়াকিল",
          "arabic": "حَسْبُنَا اللَّهُ وَنِعْمَ الْوَكِيلُ",
          "meaning":
              "আমাদের জন্য আল্লাহই যথেষ্ট এবং তিনি কতই না উত্তম কর্মবিধায়ক।",
          "Fazilat":
              "যেকোনো কঠিন বিপদে এই জিকিরটি পাঠ করলে আল্লাহ গায়েবি সাহায্য দান করেন। দুশ্চিন্তা, ভয় বা শত্রুভীতি দমনে এটি মুমিনের অন্তরে সাহস জোগায়।",
          "ref": "[সূরা আল-ইমরান: ১৭৩]",
          "target": "7"
        },
        {
          "title":
          "রদিতু বিল্লাহি রব্বন, ওয়াবিল ইসলামী দীনান, ওয়াবি মুহাম্মাদিন (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) নাবিয়্যান ওয়ারা-সূলা।",
          "arabic":
          "رَضِيتُ بِاللَّهِ رَبًّا وَبِالْإِسْلَامِ دِينًا وَبِمُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَبِيًّا وَرَسُولًا",
          "meaning":
          "আমি আল্লাহর প্রতি সন্তুষ্ট আমার প্রতিপালক হিসেবে, ইসলামের প্রতি সন্তুষ্ট আমার দ্বীন (ধর্ম) হিসেবে এবং মুহাম্মাদ (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর প্রতি সন্তুষ্ট আমার নবী ও রাসূল হিসেবে।",
          "Fazilat":
          "রাসূলুল্লাহ (সা.) বলেছেন,যে ব্যক্তি এই দোয়াটি পাঠ করবে, তার জন্য জান্নাত ওয়াজিব হয়ে যাবে, আজানের পর এটি পাঠ করলে পাঠকারীর গুনাহ মাফ করে দেওয়া হয়",
          "ref": "[সুনানে আবু দাউদ, সহীহ মুসলিম]",
          "target": "3"
        }
      ]
    },
    {
      "packageName": "সহজ ১০টি জিকির (জান্নাতের পথ)",
      "description": "প্রতিদিনের প্রয়োজনীয় ১০টি বিশেষ জিকির",
      "dhikrs": [
        {
          "title": "সুবহান আল্লাহ্",
          "arabic": "سُبْحَانَ اللَّهِ",
          "meaning": "আল্লাহ অতি পবিত্র",
          "Fazilat":
              "প্রতিদিন ১০০ বার পাঠ করলে ১০০০ সওয়াব লেখা হয় এবং ১০০০ গুনাহ মাফ করা হয়।",
          "ref": "[সহীহ মুসলিম-৪/২০৭৩]",
          "target": "100"
        },
        {
          "title": "আলহামদুলিল্লাহ",
          "arabic": "الْحَمْدُ لِلَّهِ",
          "meaning": "সমস্ত প্রশংসা আল্লাহর।",
          "Fazilat":
              "এটি সর্বোত্তম দোয়া এবং কিয়ামতের দিন মিজানের পাল্লাকে নেকিতে ভারী করে দেয়।",
          "ref": "[তিরমিযী-৫/৪৬২]",
          "target": "100"
        },
        {
          "title": "লা ইলাহা ইল্লাল্লাহ",
          "arabic": "لَا إِلٰهَ إِلَّا اللهُ",
          "meaning": "আল্লাহ ছাড়া কোনো সত্য ইলাহ নেই।",
          "Fazilat":
              "এটি সর্বোত্তম জিকির। আল্লাহ ছাড়া কোনো সত্য উপাস্য নেই—একথা স্বীকার করাই মূল ইবাদত।",
          "ref": "[তিরমিযী: ৫/৪৬২]",
          "target": "100"
        },
        {
          "title":
              "সুবহান আল্লাহ ওয়াল হামদুলিল্লাহ ওয়ালা ইলাহা ইল্লাল্লাহু আল্লাহু আকবর",
          "arabic":
              "سُبْحَانَ اللَّهِ وَالْحَمْدُ لِلَّهِ وَلَا إِلَهَ إِلَّا اللَّهُ وَاللَّهُ أَكْبَرُ",
          "meaning":
              "আল্লাহ অতি পবিত্র, সকল প্রশংসা আল্লাহর জন্য, আল্লাহ ছাড়া কোনো সত্য উপাস্য নেই এবং আল্লাহ সবচেয়ে মহান।",
          "Fazilat":
              "এই জিকিরগুলো পাঠ করলে বান্দার গুনাহ ঝরে যায়, ঠিক যেভাবে গাছের শুকনো পাতা ঝরে পড়ে।",
          "ref": "[সহীহ মুসলিম: ৪/২০৭২]",
          "target": "100"
        },
        {
          "title": "সুবহানাল্লাহি ওয়া বিহামদিহী",
          "arabic": "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ",
          "meaning": "আল্লাহর পবিত্রতা বর্ণনা করছি তাঁরই প্রশংসার সাথে।",
          "Fazilat":
              "১০০ বার পাঠ করলে সমুদ্রের ফেনা পরিমাণ গুনাহ থাকলেও তা ক্ষমা করে দেওয়া হয়।",
          "ref": "[সহীহ বুখারী: ৭/১৬৮]",
          "target": "100"
        },
        {
          "title": "সুবহানাল্লাহিল আযীম ",
          "arabic":
              "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ ، سُبْحَانَ اللَّهِ الْعَظِيمِ",
          "meaning": "আল্লাহ অতি পবিত্র, মহান, সুউচ্চ বা মর্যাদাবান",
          "Fazilat": "কিয়ামতের দিন আমল মাপার পাল্লায় এটি অত্যন্ত ওজনদার হবে। ",
          "ref": "[তিরমিযী: ৫/৫১১]",
          "target": "100"
        },
        {
          "title": "সুবহানাল্লাহি ওয়া বিহামদিহী, সুবহানাল্লাহিল আযীম ",
          "arabic":
              "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ، سُبْحَانَ اللَّهِ الْعَظِيمِ",
          "meaning":
              "আল্লাহর সপ্রশংস পবিত্রতা ঘোষণা করছি, মহান আল্লাহ অতি পবিত্র।",
          "Fazilat":
              "প্রতিদিন ১০০ বার 'সুবহানাল্লাহি ওয়া বিহামদিহী' পাঠ করলে সমুদ্রের ফেনা পরিমাণ গুনাহ থাকলেও তা ক্ষমা করা হয়।",
          "ref": " [সহীহ বুখারী: ১১/২১৩]",
          "target": "100"
        },
        {
          "title": "লা হাওলা ওয়ালা কুয়্যাতা ইল্লা বিল্লাহ",
          "arabic": "لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ",
          "meaning":
              "আল্লাহর সাহায্য ছাড়া (পাপ থেকে) ফিরে থাকার কোনো উপায় নেই এবং (নেক কাজ করার) কোনো শক্তি নেই।",
          "Fazilat":
              "এটি পাঠ করলে আল্লাহ তাআলা কঠিন বিপদ ও দুশ্চিন্তা থেকে মুক্তি দেন। ৯৯টি রোগের ঔষধ হিসেবে এটিকে গণ্য করা হয়, যার মধ্যে ক্ষুদ্রতম হলো 'উদ্বেগ' বা 'দুশ্চিন্তা'।",
          "ref": "[সহীহ আল-বুখারী -১১/২১৩, সহীহ মুসলিম-৪/২০৭৬]",
          "target": "100"
        },
        {
          "title":
              "সুবহান আল্লাহ ওয়াল হামদুলিল্লাহ ওয়ালা ইলাহা ইল্লাল্লাহু আল্লাহু আকবর ওয়ালা হাওলা ওয়ালা কুয়্যাতা ইল্লা বিল্লাহ",
          "arabic":
              "سُبْحَانَ اللَّهِ وَالْحَمْدُ لِلَّهِ وَلَا إِلَهَ إِلَّا اللَّهُ وَاللَّهُ أَكْبَرُ وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ",
          "meaning":
              "আল্লাহ অতি পবিত্র, সকল প্রশংসা আল্লাহর, আল্লাহ ছাড়া কোনো সত্য ইলাহ নেই, আল্লাহ সবচেয়ে মহান, আল্লাহর সাহায্য ছাড়া (পাপ থেকে) ফেরার উপায় নেই এবং (নেক কাজ করার) শক্তি নেই।",
          "Fazilat":
              "পাপ মোচন: রাসুলুল্লাহ (সা.) বলেছেন, পৃথিবীর বুকে যে ব্যক্তি এই বাক্যগুলো পাঠ করবে, তার সমস্ত গুনাহ মাফ করে দেওয়া হবে—যদিও তা সমুদ্রের ফেনা পরিমাণ হয়ফেরেশতাদের সুরক্ষা: এই জিকিরটি পাঠকারীকে আল্লাহর পক্ষ থেকে বিশেষ নিরাপত্তা প্রদান করা হয়।",
          "ref": "[আহমাদ: ৫১৩]",
          "target": "100"
        },
        {
          "title":
              "আল্লাহুম্মা সাল্লি ’আলা মুহাম্মাদিঁওয়া ’আলা আলি মুহাম্মাদিন্ কামা সাল্লায়তা ’আলা ইব্রাহীমা ওয়া ’আলা ’আলি ইব্রাহীমা ইন্নাকা হামীদুম মাজিদ আল্লাহুম্মা বারিক ’আলা মুহাম্মাদিঁওয়া ’আলা আলি মুহাম্মাদিন্ কামা বারাকতা ’আলা ইব্রাহীমা ওয়া ’আলা ’আলি ইব্রাহীমা ইন্নাকা হামীদুম মাজিদ",
          "arabic":
              "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ، اللَّهُمَّ بَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ",
          "meaning":
              "হে আল্লাহ! আপনি মুহাম্মদ (সা.) এবং তাঁর বংশধরদের ওপর রহমত বর্ষণ করুন, যেভাবে আপনি ইব্রাহিম (আ.) ও তাঁর বংশধরদের ওপর রহমত বর্ষণ করেছিলেন। নিশ্চয়ই আপনি অতি প্রশংসিত ও মহিমান্বিত। হে আল্লাহ! আপনি মুহাম্মদ (সা.) এবং তাঁর বংশধরদের ওপর বরকত নাজিল করুন, যেভাবে আপনি ইব্রাহিম (আ.) ও তাঁর বংশধরদের ওপর বরকত নাজিল করেছিলেন। নিশ্চয়ই আপনি অতি প্রশংসিত ও মহিমান্বিত।",
          "Fazilat":
              "রাসুলুল্লাহ (সা.) বলেছেন, যে ব্যক্তি আমার ওপর একবার দরুদ পাঠ করবে, আল্লাহ তার ওপর ১০টি রহমত নাজিল করবেন। যেকোনো দোয়ার আগে ও পরে দরুদ পাঠ করলে সেই দোয়া আল্লাহর নিকট কবুল হওয়ার সম্ভাবনা বহুগুণ বেড়ে যায়।",
          "ref": "[সহীহ মুসলিম]",
          "target": "10"
        }
      ]
    }
  ];

  static const List<Map<String, dynamic>> afterPrayerDhikrPackage = [
    {
      "packageName": "ফজর ওয়াক্তের ফরজ নামাজের পর সুন্নত আমল",
      "description":
          "ফরজ নামাজের সালাম ফেরানোর পর সরাসরি উঠে না গিয়ে কিছু সংক্ষিপ্ত অথচ অত্যন্ত ফজিলতপূর্ণ জিকির ও দোয়া পাঠ করা সুন্নাতে মুয়াক্কাদা।",
      "dhikrs": [
        {
          "title": "আস্তাগফিরুল্লাহ",
          "arabic": "أَسْتَغْفِرُ اللَّهَ",
          "meaning": "আমি আল্লাহর নিকট ক্ষমা চাচ্ছি",
          "Fazilat":
              "রাসূলুল্লাহ (সা.) বলেছেন, যে ব্যক্তি নিয়মিত ইস্তিগফার করবে, আল্লাহ তাকে প্রতিটি সংকীর্ণতা (বিপদ) থেকে বের হওয়ার পথ করে দেবেন এবং তার প্রতিটি দুশ্চিন্তা দূর করে দেবেন।",
          "ref": "[আবু দাউদ]",
          "target": "3"
        },
        {
          "title":
              "আল্লাহুম্মা আন্তাস-সালামু ওয়া মিনকাস-সালামু তাবারকতা ইয়া যাল-জালালি ওয়াল ইকরম",
          "arabic":
              "اللَّهُمَّ أَنْتَ السَّلاَمُ وَمِنْكَ السَّلاَمُ تَبَارَكْتَ يَا ذَا الْجَلالِ وَالإِكْرَامِ",
          "meaning":
              "হে আল্লাহ! আপনিই শান্তি এবং আপনার পক্ষ থেকেই শান্তি আসে। আপনি বরকতময়, হে মহিমা ও সম্মানের অধিকারী।",
          "Fazilat":
              "সালাম আল্লাহর একটি গুণবাচক নাম। এই দোয়ার মাধ্যমে স্বীকার করা হয় যে, প্রকৃত শান্তি ও নিরাপত্তা কেবল আল্লাহর পক্ষ থেকেই সম্ভব। যাল-জালালি ওয়াল ইকরম অংশটি আল্লাহর শ্রেষ্ঠত্ব ও দয়াকে একত্রে প্রকাশ করে। রাসূলুল্লাহ (সা.) এই অংশটি দিয়ে দোয়া করতে উৎসাহিত করেছেন কারণ এতে দোয়া কবুলের সম্ভাবনা বাড়ে।",
          "ref": "বিভিন্ন হাদিসে উল্লেখ আছে",
          "target": "1"
        },
        {
          "title": "সুবহান আল্লাহ্",
          "arabic": "سُبْحَانَ اللَّهِ",
          "meaning": "আল্লাহ অতি পবিত্র",
          "Fazilat":
              "প্রতিদিন ১০০ বার পাঠ করলে ১০০০ সওয়াব লেখা হয় এবং ১০০০ গুনাহ মাফ করা হয়।",
          "ref": "[সহীহ মুসলিম-৪/২০৭৩]",
          "target": "33"
        },
        {
          "title": "আলহামদুলিল্লাহ",
          "arabic": "الْحَمْدُ لِلَّهِ",
          "meaning": "সমস্ত প্রশংসা আল্লাহর।",
          "Fazilat":
              "এটি সর্বোত্তম দোয়া এবং কিয়ামতের দিন মিজানের পাল্লাকে নেকিতে ভারী করে দেয়।",
          "ref": "[তিরমিযী-৫/৪৬২]",
          "target": "33"
        },
        {
          "title": "আল্লাহু আকবার",
          "arabic": "اللَّهُ أَكْبَرُ",
          "meaning": "আল্লাহ সবচেয়ে মহান।",
          "Fazilat":
              "হাদিস অনুযায়ী, এটি মিজানের পাল্লাকে নেকি দিয়ে পূর্ণ করে দেযযেকোনো ভীতি বা বড় কোনো কাজের শুরুতে এটি পাঠ করলে অন্তরে প্রশান্তি ও আল্লাহর সাহায্য অনুভূত হয়।",
          "ref": "Unknown",
          "target": "33"
        },
        {
          "title":
              "লা ইলাহা ইল্লাল্লাহু ওয়াহদাহু লা শারিকা লাহু, লাহুল মুলকু ওয়া লাহুল হামদু, ওয়া হুয়া আলা কুল্লি শাইয়িন কাদির।",
          "arabic":
              "لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ",
          "meaning":
              "আল্লাহ ছাড়া কোনো সত্য উপাস্য নেই, তিনি একক, তাঁর কোনো শরিক নেই। রাজত্ব একমাত্র তাঁরই এবং সমস্ত প্রশংসাও তাঁরই। তিনি সবকিছুর ওপর ক্ষমতাবান।",
          "Fazilat":
              "কিয়ামতের দিন তার চেয়ে উত্তম আমল আর কেউ আনতে পারবে না (যে তার চেয়ে বেশি পাঠ করেছে সে ছাড়া)।",
          "ref": "[সহীহ বুখারী ও মুসলিম]",
          "target": "10"
        },
        {
          "title":
              "আল্লাহু লা ইলাহা ইল্লা হুয়াল হাইয়ুল কাইয়ূম, লা তা’খুযুহু সিনাতুঁ ওয়ালা নাউম। লাহূ মা ফিস সামাওয়াতি ওয়ামা ফিল আরদ্ব। মান যাল্লাযী ইয়াশফাউ ইনদাহূ ইল্লা বি-ইযনিহ। ইয়া’লামু মা বাইনা আইদীহিম ওয়ামা খালফাহুম, ওয়ালা ইউহীতূনা বিশাইয়িম মিন ইলমিহী ইল্লা বিমা শা-আ। ওয়াসিয়া কুরসিইউহুস সামাওয়াতি ওয়াল আরদ্ব, ওয়ালা ইয়াউদুহূ হিফযুহুমা ওয়া হুয়াল আলীয়্যুল আযীম।",
          "arabic":
              "اللَّهُ لَا إِلَهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلَّا بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلَّا بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ وَلَا يَئُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ",
          "meaning":
              "আল্লাহ, তিনি ছাড়া কোনো সত্য ইলাহ নেই। তিনি চিরঞ্জীব, সবকিছুর ধারক। তাঁকে তন্দ্রা ও নিদ্রা স্পর্শ করে না। আসমান ও জমিনে যা কিছু আছে সব তাঁরই। কে সেই ব্যক্তি, যে তাঁর অনুমতি ছাড়া তাঁর নিকট সুপারিশ করবে? তাদের সামনে ও পেছনে যা কিছু আছে সব তিনি জানেন। তাঁর ইচ্ছার বাইরে তাঁর জ্ঞানের কোনো কিছুই তারা আয়ত্ত করতে পারে না। তাঁর ‘কুরসি’ আসমান ও জমিন পরিব্যপ্ত। এ দুটির রক্ষণাবেক্ষণ তাঁকে ক্লান্ত করে না। তিনি সুউচ্চ, মহান।",
          "Fazilat":
              "রাসূলুল্লাহ (সা.) বলেছেন, যে ব্যক্তি প্রতি ফরজ নামাজের পর আয়াতুল কুরসি পাঠ করবে, তার জান্নাতে প্রবেশের পথে মৃত্যু ছাড়া আর কোনো বাধা থাকবে না। রাতে শোয়ার আগে এটি পাঠ করলে আল্লাহর পক্ষ থেকে একজন রক্ষক ফেরেশতা নিযুক্ত করা হয় এবং সকাল পর্যন্ত শয়তান কাছে ঘেঁষতে পারে না।",
          "ref": "[নাসায়ী, সহীহ বুখারী]",
          "target": "1"
        },
        {
          "title": "আল্লাহুম্মা আজিরনী মিনান নার",
          "arabic": "اللَّهُمَّ أَجِرْنِي مِنَ النَّارِ",
          "meaning": "হে আল্লাহ! আমাকে জাহান্নামের আগুন থেকে মুক্তি দিন",
          "Fazilat":
              "রাসূলুল্লাহ (সা.) বলেছেন, যদি কেউ মাগরিব বা ফজরের পর এই দোয়াটি ৭ বার পাঠ করে এবং ওই দিন বা রাতে তার মৃত্যু হয়, তবে আল্লাহ তাকে জাহান্নাম থেকে মুক্তির ফয়সালা লিখে দেন।",
          "ref": "[সুনানে আবু দাউদ: ৫০৭৯]",
          "target": "7"
        },
        {
          "title":
              "আল্লাহুম্মা ইন্নী আসআলুকা 'ইলমান নাফি'আন, ওয়া রিযক্বন তয়্যিবান, ওয়া 'আমালান মুতাক্বব্বালান।",
          "arabic":
              "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْمًا نَافِعًا، وَرِزْقًا طَيِّبًا، وَعَمَلًا مُتَقَبَّلًا",
          "meaning":
              "হে আল্লাহ! আমি আপনার কাছে উপকারী জ্ঞান, পবিত্র (হালাল) রিযিক এবং কবুলযোগ্য আমল প্রার্থনা করছি।",
          "Fazilat":
              "হাদিস অনুযায়ী, উম্মে সালামাহ (রা.) বর্ণনা করেছেন যে, রাসুলুল্লাহ (সা.) প্রতিদিন ফজরের নামাজের সালাম ফেরানোর পর এই দোয়াটি পাঠ করতেন।",
          "ref": "[সুনানে ইবনে মাজাহ: ৯২৫]",
          "target": "1"
        },
        {
          "title":
              "রদ্বীতু বিল্লাহি রব্বাঁও, ওয়া বিল ইসলামী দীনাঁও, ওয়া বি-মুহাম্মাদিন (সল্লাল্লাহু আলাইহি ওয়া সাল্লাম) নাবিয়্যা।",
          "arabic":
              "رَضِيتُ بِاللَّهِ رَبًّا، وَبِالْإِسْلَامِ دِينًا، وَبِمُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَبِيًّا",
          "meaning":
              "আমি আল্লাহকে প্রতিপালক হিসেবে, ইসলামকে দ্বীন (জীবন ব্যবস্থা) হিসেবে এবং মুহাম্মাদ (সা.)-কে নবী হিসেবে পেয়ে সন্তুষ্ট হলাম।",
          "Fazilat":
              "রাসুল (সা.) বলেছেন, যে ব্যক্তি প্রতিদিন সকালে ও সন্ধ্যায় ৩ বার এই দোয়াটি পাঠ করবে, কিয়ামতের দিন আল্লাহ তাআলা তাকে (তার কাঙ্ক্ষিত সওয়াব দিয়ে) সন্তুষ্ট করবেন—এটি আল্লাহর ওপর আবশ্যিক হয়ে যায়।",
          "ref": "[সুনানে তিরমিজি ও আবু দাউদ]",
          "target": "3"
        },
        {
          "title": "ফজর এর নামাজের পর পড়তে হয়:\nহুয়াল হাইয়্যুল কাইয়্যুম",
          "arabic": "هُوَ الْحَيُّ الْقَيُّوْمُ",
          "meaning": "তিনি চিরঞ্জীব, সবকিছুর ধারক।",
          "Fazilat":
              "সকাল-সন্ধ্যায় জিকির করা রিজিকে বরকত এবং শয়তানের প্ররোচনা থেকে বাঁচার অন্যতম উপায়।",
          "ref": "Unknown",
          "target": "100"
        }
      ]
    },
    {
      "packageName": "যোহর ওয়াক্তের ফরজ নামাজের পর সুন্নত আমল",
      "description":
          "যোহরের নামাজের সালাম ফেরানোর পর সরাসরি উঠে না গিয়ে কিছু সংক্ষিপ্ত অথচ অত্যন্ত ফজিলতপূর্ণ জিকির ও দোয়া পাঠ করা সুন্নাতে মুয়াক্কাদা।",
      "dhikrs": [
        {
          "title": "আস্তাগফিরুল্লাহ",
          "arabic": "أَسْتَغْفِرُ اللَّهَ",
          "meaning": "আমি আল্লাহর নিকট ক্ষমা চাচ্ছি",
          "Fazilat":
              "রাসূলুল্লাহ (সা.) বলেছেন, যে ব্যক্তি নিয়মিত ইস্তিগফার করবে, আল্লাহ তাকে প্রতিটি সংকীর্ণতা (বিপদ) থেকে বের হওয়ার পথ করে দেবেন এবং তার প্রতিটি দুশ্চিন্তা দূর করে দেবেন।",
          "ref": "[আবু দাউদ]",
          "target": "3"
        },
        {
          "title":
              "আল্লাহুম্মা আন্তাস-সালামু ওয়া মিনকাস-সালামু তাবারকতা ইয়া যাল-জালালি ওয়াল ইকরম",
          "arabic":
              "اللَّهُمَّ أَنْتَ السَّلاَمُ وَمِنْكَ السَّلاَمُ تَبَارَكْتَ يَا ذَا الْجَلالِ وَالإِكْرَامِ",
          "meaning":
              "হে আল্লাহ! আপনিই শান্তি এবং আপনার পক্ষ থেকেই শান্তি আসে। আপনি বরকতময়, হে মহিমা ও সম্মানের অধিকারী।",
          "Fazilat":
              "সালাম আল্লাহর একটি গুণবাচক নাম। এই দোয়ার মাধ্যমে স্বীকার করা হয় যে, প্রকৃত শান্তি ও নিরাপত্তা কেবল আল্লাহর পক্ষ থেকেই সম্ভব। যাল-জালালি ওয়াল ইকরম অংশটি আল্লাহর শ্রেষ্ঠত্ব ও দয়াকে একত্রে প্রকাশ করে। রাসূলুল্লাহ (সা.) এই অংশটি দিয়ে দোয়া করতে উৎসাহিত করেছেন কারণ এতে দোয়া কবুলের সম্ভাবনা বাড়ে।",
          "ref": "বিভিন্ন হাদিসে উল্লেখ আছে",
          "target": "1"
        },
        {
          "title": "সুবহান আল্লাহ্",
          "arabic": "سُبْحَانَ اللَّهِ",
          "meaning": "আল্লাহ অতি পবিত্র",
          "Fazilat":
              "প্রতিদিন ১০০ বার পাঠ করলে ১০০০ সওয়াব লেখা হয় এবং ১০০০ গুনাহ মাফ করা হয়।",
          "ref": "[সহীহ মুসলিম-৪/২০৭৩]",
          "target": "33"
        },
        {
          "title": "আলহামদুলিল্লাহ",
          "arabic": "الْحَمْدُ لِلَّهِ",
          "meaning": "সমস্ত প্রশংসা আল্লাহর।",
          "Fazilat":
              "এটি সর্বোত্তম দোয়া এবং কিয়ামতের দিন মিজানের পাল্লাকে নেকিতে ভারী করে দেয়।",
          "ref": "[তিরমিযী-৫/৪৬২]",
          "target": "33"
        },
        {
          "title": "আল্লাহু আকবার",
          "arabic": "اللَّهُ أَكْبَرُ",
          "meaning": "আল্লাহ সবচেয়ে মহান।",
          "Fazilat":
              "হাদিস অনুযায়ী, এটি মিজানের পাল্লাকে নেকি দিয়ে পূর্ণ করে দেযযেকোনো ভীতি বা বড় কোনো কাজের শুরুতে এটি পাঠ করলে অন্তরে প্রশান্তি ও আল্লাহর সাহায্য অনুভূত হয়।",
          "ref": "Unknown",
          "target": "33"
        },
        {
          "title":
              "লা ইলাহা ইল্লাল্লাহু ওয়াহদাহু লা শারিকা লাহু, লাহুল মুলকু ওয়া লাহুল হামদু, ওয়া হুয়া আলা কুল্লি শাইয়িন কাদির।",
          "arabic":
              "لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ",
          "meaning":
              "আল্লাহ ছাড়া কোনো সত্য উপাস্য নেই, তিনি একক, তাঁর কোনো শরিক নেই। রাজত্ব একমাত্র তাঁরই এবং সমস্ত প্রশংসাও তাঁরই। তিনি সবকিছুর ওপর ক্ষমতাবান।",
          "Fazilat":
              "কিয়ামতের দিন তার চেয়ে উত্তম আমল আর কেউ আনতে পারবে না (যে তার চেয়ে বেশি পাঠ করেছে সে ছাড়া)।",
          "ref": "[সহীহ বুখারী ও মুসলিম]",
          "target": "1"
        },
        {
          "title":
              "আল্লাহু লা ইলাহা ইল্লা হুয়াল হাইয়ুল কাইয়ূম, লা তা’খুযুহু সিনাতুঁ ওয়ালা নাউম। লাহূ মা ফিস সামাওয়াতি ওয়ামা ফিল আরদ্ব। মান যাল্লাযী ইয়াশফাউ ইনদাহূ ইল্লা বি-ইযনিহ। ইয়া’লামু মা বাইনা আইদীহিম ওয়ামা খালফাহুম, ওয়ালা ইউহীতূনা বিশাইয়িম মিন ইলমিহী ইল্লা বিমা শা-আ। ওয়াসিয়া কুরসিইউহুস সামাওয়াতি ওয়াল আরদ্ব, ওয়ালা ইয়াউদুহূ হিফযুহুমা ওয়া হুয়াল আলীয়্যুল আযীম।",
          "arabic":
              "اللَّهُ لَا إِلَهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلَّا بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلَّا بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ وَلَا يَئُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ",
          "meaning":
              "আল্লাহ, তিনি ছাড়া কোনো সত্য ইলাহ নেই। তিনি চিরঞ্জীব, সবকিছুর ধারক। তাঁকে তন্দ্রা ও নিদ্রা স্পর্শ করে না। আসমান ও জমিনে যা কিছু আছে সব তাঁরই। কে সেই ব্যক্তি, যে তাঁর অনুমতি ছাড়া তাঁর নিকট সুপারিশ করবে? তাদের সামনে ও পেছনে যা কিছু আছে সব তিনি জানেন। তাঁর ইচ্ছার বাইরে তাঁর জ্ঞানের কোনো কিছুই তারা আয়ত্ত করতে পারে না। তাঁর ‘কুরসি’ আসমান ও জমিন পরিব্যপ্ত। এ দুটির রক্ষণাবেক্ষণ তাঁকে ক্লান্ত করে না। তিনি সুউচ্চ, মহান।",
          "Fazilat":
              "রাসূলুল্লাহ (সা.) বলেছেন, যে ব্যক্তি প্রতি ফরজ নামাজের পর আয়াতুল কুরসি পাঠ করবে, তার জান্নাতে প্রবেশের পথে মৃত্যু ছাড়া আর কোনো বাধা থাকবে না। রাতে শোয়ার আগে এটি পাঠ করলে আল্লাহর পক্ষ থেকে একজন রক্ষক ফেরেশতা নিযুক্ত করা হয় এবং সকাল পর্যন্ত শয়তান কাছে ঘেঁষতে পারে না।",
          "ref": "[নাসায়ী, সহীহ বুখারী]",
          "target": "1"
        },
        {
          "title": "যোহর এর নামাজের পর পড়তে হয়:\nহুয়াল আলিয়্যুল আজীম",
          "arabic": "هُوَ الْعَلِيُّ الْعَظِيْمُ",
          "meaning": "তিনি অতি উচ্চ, অতি মহান।",
          "Fazilat":
              "নিয়মিত আল্লাহর জিকির করলে অন্তরে প্রশান্তি আসে এবং দুনিয়াবী চিন্তা-পেরেশানি থেকে মুক্তি পাওয়া যায়।",
          "ref": "Unknown",
          "target": "100"
        }
      ]
    },
    {
      "packageName": "আছর ওয়াক্তের ফরজ নামাজের পর সুন্নত আমল",
      "description":
          "আছরের নামাজের সালাম ফেরানোর পর সরাসরি উঠে না গিয়ে কিছু সংক্ষিপ্ত অথচ অত্যন্ত ফজিলতপূর্ণ জিকির ও দোয়া পাঠ করা সুন্নাতে মুয়াক্কাদা।",
      "dhikrs": [
        {
          "title": "আস্তাগফিরুল্লাহ",
          "arabic": "أَسْتَغْفِرُ اللَّهَ",
          "meaning": "আমি আল্লাহর নিকট ক্ষমা চাচ্ছি",
          "Fazilat":
              "রাসূলুল্লাহ (সা.) বলেছেন, যে ব্যক্তি নিয়মিত ইস্তিগফার করবে, আল্লাহ তাকে প্রতিটি সংকীর্ণতা (বিপদ) থেকে বের হওয়ার পথ করে দেবেন এবং তার প্রতিটি দুশ্চিন্তা দূর করে দেবেন।",
          "ref": "[আবু দাউদ]",
          "target": "3"
        },
        {
          "title":
              "আল্লাহুম্মা আন্তাস-সালামু ওয়া মিনকাস-সালামু তাবারকতা ইয়া যাল-জালালি ওয়াল ইকরম",
          "arabic":
              "اللَّهُمَّ أَنْتَ السَّلاَمُ وَمِنْكَ السَّلاَمُ تَبَارَكْتَ يَا ذَا الْجَلالِ وَالإِكْرَامِ",
          "meaning":
              "হে আল্লাহ! আপনিই শান্তি এবং আপনার পক্ষ থেকেই শান্তি আসে। আপনি বরকতময়, হে মহিমা ও সম্মানের অধিকারী।",
          "Fazilat":
              "সালাম আল্লাহর একটি গুণবাচক নাম। এই দোয়ার মাধ্যমে স্বীকার করা হয় যে, প্রকৃত শান্তি ও নিরাপত্তা কেবল আল্লাহর পক্ষ থেকেই সম্ভব। যাল-জালালি ওয়াল ইকরম অংশটি আল্লাহর শ্রেষ্ঠত্ব ও দয়াকে একত্রে প্রকাশ করে। রাসূলুল্লাহ (সা.) এই অংশটি দিয়ে দোয়া করতে উৎসাহিত করেছেন কারণ এতে দোয়া কবুলের সম্ভাবনা বাড়ে।",
          "ref": "বিভিন্ন হাদিসে উল্লেখ আছে",
          "target": "1"
        },
        {
          "title": "সুবহান আল্লাহ্",
          "arabic": "سُبْحَانَ اللَّهِ",
          "meaning": "আল্লাহ অতি পবিত্র",
          "Fazilat":
              "প্রতিদিন ১০০ বার পাঠ করলে ১০০০ সওয়াব লেখা হয় এবং ১০০০ গুনাহ মাফ করা হয়।",
          "ref": "[সহীহ মুসলিম-৪/২০৭৩]",
          "target": "33"
        },
        {
          "title": "আলহামদুলিল্লাহ",
          "arabic": "الْحَمْدُ لِلَّهِ",
          "meaning": "সমস্ত প্রশংসা আল্লাহর।",
          "Fazilat":
              "এটি সর্বোত্তম দোয়া এবং কিয়ামতের দিন মিজানের পাল্লাকে নেকিতে ভারী করে দেয়।",
          "ref": "[তিরমিযী-৫/৪৬২]",
          "target": "33"
        },
        {
          "title": "আল্লাহু আকবার",
          "arabic": "اللَّهُ أَكْبَرُ",
          "meaning": "আল্লাহ সবচেয়ে মহান।",
          "Fazilat":
              "হাদিস অনুযায়ী, এটি মিজানের পাল্লাকে নেকি দিয়ে পূর্ণ করে দেযযেকোনো ভীতি বা বড় কোনো কাজের শুরুতে এটি পাঠ করলে অন্তরে প্রশান্তি ও আল্লাহর সাহায্য অনুভূত হয়।",
          "ref": "Unknown",
          "target": "33"
        },
        {
          "title":
              "লা ইলাহা ইল্লাল্লাহু ওয়াহদাহু লা শারিকা লাহু, লাহুল মুলকু ওয়া লাহুল হামদু, ওয়া হুয়া আলা কুল্লি শাইয়িন কাদির।",
          "arabic":
              "لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ",
          "meaning":
              "আল্লাহ ছাড়া কোনো সত্য উপাস্য নেই, তিনি একক, তাঁর কোনো শরিক নেই। রাজত্ব একমাত্র তাঁরই এবং সমস্ত প্রশংসাও তাঁরই। তিনি সবকিছুর ওপর ক্ষমতাবান।",
          "Fazilat":
              "কিয়ামতের দিন তার চেয়ে উত্তম আমল আর কেউ আনতে পারবে না (যে তার চেয়ে বেশি পাঠ করেছে সে ছাড়া)।",
          "ref": "[সহীহ বুখারী ও মুসলিম]",
          "target": "1"
        },
        {
          "title":
              "আল্লাহু লা ইলাহা ইল্লা হুয়াল হাইয়ুল কাইয়ূম, লা তা’খুযুহু সিনাতুঁ ওয়ালা নাউম। লাহূ মা ফিস সামাওয়াতি ওয়ামা ফিল আরদ্ব। মান যাল্লাযী ইয়াশফাউ ইনদাহূ ইল্লা বি-ইযনিহ। ইয়া’লামু মা বাইনা আইদীহিম ওয়ামা খালফাহুম, ওয়ালা ইউহীতূনা বিশাইয়িম মিন ইলমিহী ইল্লা বিমা শা-আ। ওয়াসিয়া কুরসিইউহুস সামাওয়াতি ওয়াল আরদ্ব, ওয়ালা ইয়াউদুহূ হিফযুহুমা ওয়া হুয়াল আলীয়্যুল আযীম।",
          "arabic":
              "اللَّهُ لَا إِلَهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلَّا بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلَّا بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ وَلَا يَئُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ",
          "meaning":
              "আল্লাহ, তিনি ছাড়া কোনো সত্য ইলাহ নেই। তিনি চিরঞ্জীব, সবকিছুর ধারক। তাঁকে তন্দ্রা ও নিদ্রা স্পর্শ করে না। আসমান ও জমিনে যা কিছু আছে সব তাঁরই। কে সেই ব্যক্তি, যে তাঁর অনুমতি ছাড়া তাঁর নিকট সুপারিশ করবে? তাদের সামনে ও পেছনে যা কিছু আছে সব তিনি জানেন। তাঁর ইচ্ছার বাইরে তাঁর জ্ঞানের কোনো কিছুই তারা আয়ত্ত করতে পারে না। তাঁর ‘কুরসি’ আসমান ও জমিন পরিব্যপ্ত। এ দুটির রক্ষণাবেক্ষণ তাঁকে ক্লান্ত করে না। তিনি সুউচ্চ, মহান।",
          "Fazilat":
              "রাসূলুল্লাহ (সা.) বলেছেন, যে ব্যক্তি প্রতি ফরজ নামাজের পর আয়াতুল কুরসি পাঠ করবে, তার জান্নাতে প্রবেশের পথে মৃত্যু ছাড়া আর কোনো বাধা থাকবে না। রাতে শোয়ার আগে এটি পাঠ করলে আল্লাহর পক্ষ থেকে একজন রক্ষক ফেরেশতা নিযুক্ত করা হয় এবং সকাল পর্যন্ত শয়তান কাছে ঘেঁষতে পারে না।",
          "ref": "[নাসায়ী, সহীহ বুখারী]",
          "target": "1"
        },
        {
          "title": "আসর এর নামাজের পর পড়তে হয়:\nহুয়ার রাহমানুর রাহীম",
          "arabic": "هُوَ الرَّحْمٰنُ الرَّحِيْمُ",
          "meaning": "তিনি পরম দয়াময়, অতি দয়ালু।",
          "Fazilat":
              "নিয়মিত আল্লাহর জিকির করলে অন্তরে প্রশান্তি আসে এবং দুনিয়াবী চিন্তা-পেরেশানি থেকে মুক্তি পাওয়া যায়।",
          "ref": "Unknown",
          "target": "100"
        }
      ]
    },
    {
      "packageName": "মাগরিবের ওয়াক্তের ফরজ নামাজের পর সুন্নত আমল",
      "description":
          "মাগরিবের নামাজের সালাম ফেরানোর পর সরাসরি উঠে না গিয়ে কিছু সংক্ষিপ্ত অথচ অত্যন্ত ফজিলতপূর্ণ জিকির ও দোয়া পাঠ করা সুন্নাতে মুয়াক্কাদা।",
      "dhikrs": [
        {
          "title": "আস্তাগফিরুল্লাহ",
          "arabic": "أَسْتَغْفِرُ اللَّهَ",
          "meaning": "আমি আল্লাহর নিকট ক্ষমা চাচ্ছি",
          "Fazilat":
              "রাসূলুল্লাহ (সা.) বলেছেন, যে ব্যক্তি নিয়মিত ইস্তিগফার করবে, আল্লাহ তাকে প্রতিটি সংকীর্ণতা (বিপদ) থেকে বের হওয়ার পথ করে দেবেন এবং তার প্রতিটি দুশ্চিন্তা দূর করে দেবেন।",
          "ref": "[আবু দাউদ]",
          "target": "3"
        },
        {
          "title":
              "আল্লাহুম্মা আন্তাস-সালামু ওয়া মিনকাস-সালামু তাবারকতা ইয়া যাল-জালালি ওয়াল ইকরম",
          "arabic":
              "اللَّهُمَّ أَنْتَ السَّلاَمُ وَمِنْكَ السَّلاَمُ تَبَارَكْتَ يَا ذَا الْجَلالِ وَالإِكْرَامِ",
          "meaning":
              "হে আল্লাহ! আপনিই শান্তি এবং আপনার পক্ষ থেকেই শান্তি আসে। আপনি বরকতময়, হে মহিমা ও সম্মানের অধিকারী।",
          "Fazilat":
              "সালাম আল্লাহর একটি গুণবাচক নাম। এই দোয়ার মাধ্যমে স্বীকার করা হয় যে, প্রকৃত শান্তি ও নিরাপত্তা কেবল আল্লাহর পক্ষ থেকেই সম্ভব। যাল-জালালি ওয়াল ইকরম অংশটি আল্লাহর শ্রেষ্ঠত্ব ও দয়াকে একত্রে প্রকাশ করে। রাসূলুল্লাহ (সা.) এই অংশটি দিয়ে দোয়া করতে উৎসাহিত করেছেন কারণ এতে দোয়া কবুলের সম্ভাবনা বাড়ে।",
          "ref": "বিভিন্ন হাদিসে উল্লেখ আছে",
          "target": "1"
        },
        {
          "title": "সুবহান আল্লাহ্",
          "arabic": "سُبْحَانَ اللَّهِ",
          "meaning": "আল্লাহ অতি পবিত্র",
          "Fazilat":
              "প্রতিদিন ১০০ বার পাঠ করলে ১০০০ সওয়াব লেখা হয় এবং ১০০০ গুনাহ মাফ করা হয়।",
          "ref": "[সহীহ মুসলিম-৪/২০৭৩]",
          "target": "33"
        },
        {
          "title": "আলহামদুলিল্লাহ",
          "arabic": "الْحَمْدُ لِلَّهِ",
          "meaning": "সমস্ত প্রশংসা আল্লাহর।",
          "Fazilat":
              "এটি সর্বোত্তম দোয়া এবং কিয়ামতের দিন মিজানের পাল্লাকে নেকিতে ভারী করে দেয়।",
          "ref": "[তিরমিযী-৫/৪৬২]",
          "target": "33"
        },
        {
          "title": "আল্লাহু আকবার",
          "arabic": "اللَّهُ أَكْبَرُ",
          "meaning": "আল্লাহ সবচেয়ে মহান।",
          "Fazilat":
              "হাদিস অনুযায়ী, এটি মিজানের পাল্লাকে নেকি দিয়ে পূর্ণ করে দেযযেকোনো ভীতি বা বড় কোনো কাজের শুরুতে এটি পাঠ করলে অন্তরে প্রশান্তি ও আল্লাহর সাহায্য অনুভূত হয়।",
          "ref": "Unknown",
          "target": "33"
        },
        {
          "title":
              "লা ইলাহা ইল্লাল্লাহু ওয়াহদাহু লা শারিকা লাহু, লাহুল মুলকু ওয়া লাহুল হামদু, ওয়া হুয়া আলা কুল্লি শাইয়িন কাদির।",
          "arabic":
              "لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ",
          "meaning":
              "আল্লাহ ছাড়া কোনো সত্য উপাস্য নেই, তিনি একক, তাঁর কোনো শরিক নেই। রাজত্ব একমাত্র তাঁরই এবং সমস্ত প্রশংসাও তাঁরই। তিনি সবকিছুর ওপর ক্ষমতাবান।",
          "Fazilat":
              "কিয়ামতের দিন তার চেয়ে উত্তম আমল আর কেউ আনতে পারবে না (যে তার চেয়ে বেশি পাঠ করেছে সে ছাড়া)।",
          "ref": "[সহীহ বুখারী ও মুসলিম]",
          "target": "10"
        },
        {
          "title":
              "আল্লাহু লা ইলাহা ইল্লা হুয়াল হাইয়ুল কাইয়ূম, লা তা’খুযুহু সিনাতুঁ ওয়ালা নাউম। লাহূ মা ফিস সামাওয়াতি ওয়ামা ফিল আরদ্ব। মান যাল্লাযী ইয়াশফাউ ইনদাহূ ইল্লা বি-ইযনিহ। ইয়া’লামু মা বাইনা আইদীহিম ওয়ামা খালফাহুম, ওয়ালা ইউহীতূনা বিশাইয়িম মিন ইলমিহী ইল্লা বিমা শা-আ। ওয়াসিয়া কুরসিইউহুস সামাওয়াতি ওয়াল আরদ্ব, ওয়ালা ইয়াউদুহূ হিফযুহুমা ওয়া হুয়াল আলীয়্যুল আযীম।",
          "arabic":
              "اللَّهُ لَا إِلَهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلَّا بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلَّا بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ وَلَا يَئُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ",
          "meaning":
              "আল্লাহ, তিনি ছাড়া কোনো সত্য ইলাহ নেই। তিনি চিরঞ্জীব, সবকিছুর ধারক। তাঁকে তন্দ্রা ও নিদ্রা স্পর্শ করে না। আসমান ও জমিনে যা কিছু আছে সব তাঁরই। কে সেই ব্যক্তি, যে তাঁর অনুমতি ছাড়া তাঁর নিকট সুপারিশ করবে? তাদের সামনে ও পেছনে যা কিছু আছে সব তিনি জানেন। তাঁর ইচ্ছার বাইরে তাঁর জ্ঞানের কোনো কিছুই তারা আয়ত্ত করতে পারে না। তাঁর ‘কুরসি’ আসমান ও জমিন পরিব্যপ্ত। এ দুটির রক্ষণাবেক্ষণ তাঁকে ক্লান্ত করে না। তিনি সুউচ্চ, মহান।",
          "Fazilat":
              "রাসূলুল্লাহ (সা.) বলেছেন, যে ব্যক্তি প্রতি ফরজ নামাজের পর আয়াতুল কুরসি পাঠ করবে, তার জান্নাতে প্রবেশের পথে মৃত্যু ছাড়া আর কোনো বাধা থাকবে না। রাতে শোয়ার আগে এটি পাঠ করলে আল্লাহর পক্ষ থেকে একজন রক্ষক ফেরেশতা নিযুক্ত করা হয় এবং সকাল পর্যন্ত শয়তান কাছে ঘেঁষতে পারে না।",
          "ref": "[নাসায়ী, সহীহ বুখারী]",
          "target": "1"
        },
        {
          "title": "আল্লাহুম্মা আজিরনী মিনান নার",
          "arabic": "اللَّهُمَّ أَجِرْنِي مِنَ النَّارِ",
          "meaning": "হে আল্লাহ! আমাকে জাহান্নামের আগুন থেকে মুক্তি দিন",
          "Fazilat":
              "রাসূলুল্লাহ (সা.) বলেছেন, যদি কেউ মাগরিব বা ফজরের পর এই দোয়াটি ৭ বার পাঠ করে এবং ওই দিন বা রাতে তার মৃত্যু হয়, তবে আল্লাহ তাকে জাহান্নাম থেকে মুক্তির ফয়সালা লিখে দেন।",
          "ref": "[সুনানে আবু দাউদ: ৫০৭৯]",
          "target": "7"
        },
        {
          "title":
              "রদ্বীতু বিল্লাহি রব্বাঁও, ওয়া বিল ইসলামী দীনাঁও, ওয়া বি-মুহাম্মাদিন (সল্লাল্লাহু আলাইহি ওয়া সাল্লাম) নাবিয়্যা।",
          "arabic":
              "رَضِيتُ بِاللَّهِ رَبًّا، وَبِالْإِسْلَامِ دِينًا، وَبِمُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَبِيًّا",
          "meaning":
              "আমি আল্লাহকে প্রতিপালক হিসেবে, ইসলামকে দ্বীন (জীবন ব্যবস্থা) হিসেবে এবং মুহাম্মাদ (সা.)-কে নবী হিসেবে পেয়ে সন্তুষ্ট হলাম।",
          "Fazilat":
              "রাসুল (সা.) বলেছেন, যে ব্যক্তি প্রতিদিন সকালে ও সন্ধ্যায় ৩ বার এই দোয়াটি পাঠ করবে, কিয়ামতের দিন আল্লাহ তাআলা তাকে (তার কাঙ্ক্ষিত সওয়াব দিয়ে) সন্তুষ্ট করবেন—এটি আল্লাহর ওপর আবশ্যিক হয়ে যায়।",
          "ref": "[সুনানে তিরমিজি ও আবু দাউদ]",
          "target": "3"
        },
        {
          "title": "আউযু বিকালিমা-তিল্লাহিত তা-ম্মাতি মিন শাররি মা খালাক্ব।",
          "arabic":
              "أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ",
          "meaning":
              "আল্লাহর পরিপূর্ণ কালামসমূহের উসিলায় আমি তাঁর সৃষ্টিজগতের সমস্ত অনিষ্ট থেকে আশ্রয় চাচ্ছি।",
          "Fazilat":
              "রাসূলুল্লাহ (সা.) বলেছেন, যে ব্যক্তি কোনো মনজিলে (থাকার জায়গায়) অবতরণ করে এই দোয়াটি পাঠ করবে, ওই জায়গা থেকে বিদায় না হওয়া পর্যন্ত কোনো কিছুই তার ক্ষতি করতে পারবে না।",
          "ref": "[সহীহ মুসলিম: ২৭০৮]",
          "target": "3"
        },
        {
          "title": "মাগরিব এর নামাজের পর পড়তে হয়:\nহুয়াল গাফুরুর রাহীম",
          "arabic": "هُوَ الْغَفُوْرُ الرَّحِيْمُ",
          "meaning": "তিনি অত্যন্ত ক্ষমাশীল, অতি দয়ালু।",
          "Fazilat":
              "মাগরিবের পরের জিকিরটি (গাফুরুর রাহীম) মূলত ক্ষমা প্রার্থনার শামিল, যা পাপ মোচনে সহায়তা করে।",
          "ref": "Unknown",
          "target": "100"
        }
      ]
    },
    {
      "packageName": "এশার ওয়াক্তের ফরজ নামাজের পর সুন্নত আমল",
      "description":
          "এশার নামাজের সালাম ফেরানোর পর সরাসরি উঠে না গিয়ে কিছু সংক্ষিপ্ত অথচ অত্যন্ত ফজিলতপূর্ণ জিকির ও দোয়া পাঠ করা সুন্নাতে মুয়াক্কাদা।",
      "dhikrs": [
        {
          "title": "আস্তাগফিরুল্লাহ",
          "arabic": "أَسْتَغْفِرُ اللَّهَ",
          "meaning": "আমি আল্লাহর নিকট ক্ষমা চাচ্ছি",
          "Fazilat":
              "রাসূলুল্লাহ (সা.) বলেছেন, যে ব্যক্তি নিয়মিত ইস্তিগফার করবে, আল্লাহ তাকে প্রতিটি সংকীর্ণতা (বিপদ) থেকে বের হওয়ার পথ করে দেবেন এবং তার প্রতিটি দুশ্চিন্তা দূর করে দেবেন।",
          "ref": "[আবু দাউদ]",
          "target": "3"
        },
        {
          "title":
              "আল্লাহুম্মা আন্তাস-সালামু ওয়া মিনকাস-সালামু তাবারকতা ইয়া যাল-জালালি ওয়াল ইকরম",
          "arabic":
              "اللَّهُمَّ أَنْتَ السَّلاَمُ وَمِنْكَ السَّلاَمُ تَبَارَكْتَ يَا ذَا الْجَلالِ وَالإِكْرَامِ",
          "meaning":
              "হে আল্লাহ! আপনিই শান্তি এবং আপনার পক্ষ থেকেই শান্তি আসে। আপনি বরকতময়, হে মহিমা ও সম্মানের অধিকারী।",
          "Fazilat":
              "সালাম আল্লাহর একটি গুণবাচক নাম। এই দোয়ার মাধ্যমে স্বীকার করা হয় যে, প্রকৃত শান্তি ও নিরাপত্তা কেবল আল্লাহর পক্ষ থেকেই সম্ভব। যাল-জালালি ওয়াল ইকরম অংশটি আল্লাহর শ্রেষ্ঠত্ব ও দয়াকে একত্রে প্রকাশ করে। রাসূলুল্লাহ (সা.) এই অংশটি দিয়ে দোয়া করতে উৎসাহিত করেছেন কারণ এতে দোয়া কবুলের সম্ভাবনা বাড়ে।",
          "ref": "বিভিন্ন হাদিসে উল্লেখ আছে",
          "target": "1"
        },
        {
          "title": "সুবহান আল্লাহ্",
          "arabic": "سُبْحَانَ اللَّهِ",
          "meaning": "আল্লাহ অতি পবিত্র",
          "Fazilat":
              "প্রতিদিন ১০০ বার পাঠ করলে ১০০০ সওয়াব লেখা হয় এবং ১০০০ গুনাহ মাফ করা হয়।",
          "ref": "[সহীহ মুসলিম-৪/২০৭৩]",
          "target": "33"
        },
        {
          "title": "আলহামদুলিল্লাহ",
          "arabic": "الْحَمْدُ لِلَّهِ",
          "meaning": "সমস্ত প্রশংসা আল্লাহর।",
          "Fazilat":
              "এটি সর্বোত্তম দোয়া এবং কিয়ামতের দিন মিজানের পাল্লাকে নেকিতে ভারী করে দেয়।",
          "ref": "[তিরমিযী-৫/৪৬২]",
          "target": "33"
        },
        {
          "title": "আল্লাহু আকবার",
          "arabic": "اللَّهُ أَكْبَرُ",
          "meaning": "আল্লাহ সবচেয়ে মহান।",
          "Fazilat":
              "হাদিস অনুযায়ী, এটি মিজানের পাল্লাকে নেকি দিয়ে পূর্ণ করে দেযযেকোনো ভীতি বা বড় কোনো কাজের শুরুতে এটি পাঠ করলে অন্তরে প্রশান্তি ও আল্লাহর সাহায্য অনুভূত হয়।",
          "ref": "Unknown",
          "target": "33"
        },
        {
          "title":
              "লা ইলাহা ইল্লাল্লাহু ওয়াহদাহু লা শারিকা লাহু, লাহুল মুলকু ওয়া লাহুল হামদু, ওয়া হুয়া আলা কুল্লি শাইয়িন কাদির।",
          "arabic":
              "لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ",
          "meaning":
              "আল্লাহ ছাড়া কোনো সত্য উপাস্য নেই, তিনি একক, তাঁর কোনো শরিক নেই। রাজত্ব একমাত্র তাঁরই এবং সমস্ত প্রশংসাও তাঁরই। তিনি সবকিছুর ওপর ক্ষমতাবান।",
          "Fazilat":
              "কিয়ামতের দিন তার চেয়ে উত্তম আমল আর কেউ আনতে পারবে না (যে তার চেয়ে বেশি পাঠ করেছে সে ছাড়া)।",
          "ref": "[সহীহ বুখারী ও মুসলিম]",
          "target": "1"
        },
        {
          "title":
              "আল্লাহু লা ইলাহা ইল্লা হুয়াল হাইয়ুল কাইয়ূম, লা তা’খুযুহু সিনাতুঁ ওয়ালা নাউম। লাহূ মা ফিস সামাওয়াতি ওয়ামা ফিল আরদ্ব। মান যাল্লাযী ইয়াশফাউ ইনদাহূ ইল্লা বি-ইযনিহ। ইয়া’লামু মা বাইনা আইদীহিম ওয়ামা খালফাহুম, ওয়ালা ইউহীতূনা বিশাইয়িম মিন ইলমিহী ইল্লা বিমা শা-আ। ওয়াসিয়া কুরসিইউহুস সামাওয়াতি ওয়াল আরদ্ব, ওয়ালা ইয়াউদুহূ হিফযুহুমা ওয়া হুয়াল আলীয়্যুল আযীম।",
          "arabic":
              "اللَّهُ لَا إِلَهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلَّا بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلَّا بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ وَلَا يَئُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ",
          "meaning":
              "আল্লাহ, তিনি ছাড়া কোনো সত্য ইলাহ নেই। তিনি চিরঞ্জীব, সবকিছুর ধারক। তাঁকে তন্দ্রা ও নিদ্রা স্পর্শ করে না। আসমান ও জমিনে যা কিছু আছে সব তাঁরই। কে সেই ব্যক্তি, যে তাঁর অনুমতি ছাড়া তাঁর নিকট সুপারিশ করবে? তাদের সামনে ও পেছনে যা কিছু আছে সব তিনি জানেন। তাঁর ইচ্ছার বাইরে তাঁর জ্ঞানের কোনো কিছুই তারা আয়ত্ত করতে পারে না। তাঁর ‘কুরসি’ আসমান ও জমিন পরিব্যপ্ত। এ দুটির রক্ষণাবেক্ষণ তাঁকে ক্লান্ত করে না। তিনি সুউচ্চ, মহান।",
          "Fazilat":
              "রাসূলুল্লাহ (সা.) বলেছেন, যে ব্যক্তি প্রতি ফরজ নামাজের পর আয়াতুল কুরসি পাঠ করবে, তার জান্নাতে প্রবেশের পথে মৃত্যু ছাড়া আর কোনো বাধা থাকবে না। রাতে শোয়ার আগে এটি পাঠ করলে আল্লাহর পক্ষ থেকে একজন রক্ষক ফেরেশতা নিযুক্ত করা হয় এবং সকাল পর্যন্ত শয়তান কাছে ঘেঁষতে পারে না।",
          "ref": "[নাসায়ী, সহীহ বুখারী]",
          "target": "1"
        },
        {
          "title": "এশা এর নামাজের পর পড়তে হয়:\nহুয়াল লাতীফুল খাবীর",
          "arabic": "هُوَ اللَّطِيْفُ الْخَبِيْرُ",
          "meaning": "তিনি অতি সূক্ষ্মদর্শী, সর্ববিষয়ে সম্যক অবহিত।",
          "Fazilat":
              "আল্লাহর গুণবাচক নামের মাধ্যমে তাঁকে ডাকলে মহান আল্লাহ বান্দার প্রতি সন্তুষ্ট হন।",
          "ref": "Unknown",
          "target": "100"
        }
      ]
    },
    {
      "packageName":
          "নামাজের দুই সিজদাহর মধ্যবর্তী সময়ে পড়ার অত্যন্ত অর্থবহ একটি দোয়া",
      "description": "",
      "dhikrs": [
        {
          "title":
              "আল্লাহুম্মাগফিরলী, ওয়ারহামনী, ওয়াহদিনী, ওয়া 'আ-ফিনী, ওয়ারযুক্বনী, ওয়াজবুরনী, ওয়ারফানি।",
          "arabic":
              "اللَّهُمَّ اغْفِرْ لِي، وَارْحَمْنِي، وَاهْدِنِي، وَعَافِنِي، وَارْزُقْنِي، وَاجْبُرْنِي، وَارْفَعْنِي",
          "meaning":
              "হে আল্লাহ! আমাকে ক্ষমা করুন। আমার ওপর রহম করুন। আমাকে সঠিক পথে পরিচালিত করুন। আমাকে নিরাপত্তা/সুস্থতা দান করুন। আমাকে রিযিক দান করুন। আমার সকল ক্ষয়ক্ষতি পূরণ করে দিন। আমার মর্যাদা বৃদ্ধি করুন।",
          "Fazilat":
              "নামাজ কবুল হওয়ার জন্য সিজদাহর মাঝখানের এই স্থিরতা (তামানীনাহ) ওয়াজিব বা জরুরি, আর এই সময়ে দোয়া করা সুন্নাহ।",
          "ref": "[আবু দাউদ: ৮৫০, তিরমিজী: ২৮৪, ২৮৫, ইবনু মাজাহ: ৮৯৮]",
          "target": "1"
        }
      ]
    },
    {
      "packageName": "নামাজের শেষ বৈঠকে অথবা ঘুমের আগে পাঠ করুন",
      "description":
          "হাদিস অনুযায়ী, রাসুলুল্লাহ (সা.) যখন রাতে তাহাজ্জুদ নামাজের জন্য দাঁড়াতেন, তখন নামাজের শুরুতে এই জিকিরগুলো ১০ বার করে পাঠ করতেন (সুনানে আবু দাউদ, হাদিস নং: ৭৬৬)",
      "dhikrs": [
        {
          "title": "আলহামদুলিল্লাহ",
          "arabic": "الْحَمْدُ لِلَّهِ",
          "meaning": "সমস্ত প্রশংসা আল্লাহর।",
          "Fazilat":
              "এটি সর্বোত্তম দোয়া এবং কিয়ামতের দিন মিজানের পাল্লাকে নেকিতে ভারী করে দেয়।",
          "ref": "[তিরমিযী-৫/৪৬২]",
          "target": "10"
        },
        {
          "title": "আল্লাহু আকবার",
          "arabic": "اللَّهُ أَكْبَرُ",
          "meaning": "আল্লাহ সবচেয়ে মহান।",
          "Fazilat":
              "হাদিস অনুযায়ী, এটি মিজানের পাল্লাকে নেকি দিয়ে পূর্ণ করে দেযযেকোনো ভীতি বা বড় কোনো কাজের শুরুতে এটি পাঠ করলে অন্তরে প্রশান্তি ও আল্লাহর সাহায্য অনুভূত হয়।",
          "ref": "Unknown",
          "target": "10"
        },
        {
          "title": "সুবহানাল্লাহি ওয়া বিহামদিহী",
          "arabic": "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ",
          "meaning": "আল্লাহর পবিত্রতা বর্ণনা করছি তাঁরই প্রশংসার সাথে।",
          "Fazilat":
              "১০০ বার পাঠ করলে সমুদ্রের ফেনা পরিমাণ গুনাহ থাকলেও তা ক্ষমা করে দেওয়া হয়।",
          "ref": "[সহীহ বুখারী: ৭/১৬৮]",
          "target": "10"
        },
        {
          "title": "আস্তাগফিরুল্লাহ",
          "arabic": "أَسْتَغْفِرُ اللَّهَ",
          "meaning": "আমি আল্লাহর নিকট ক্ষমা চাচ্ছি",
          "Fazilat":
              "রাসূলুল্লাহ (সা.) বলেছেন, যে ব্যক্তি নিয়মিত ইস্তিগফার করবে, আল্লাহ তাকে প্রতিটি সংকীর্ণতা (বিপদ) থেকে বের হওয়ার পথ করে দেবেন এবং তার প্রতিটি দুশ্চিন্তা দূর করে দেবেন।",
          "ref": "[আবু দাউদ]",
          "target": "10"
        },
        {
          "title": "লা ইলাহা ইল্লাল্লাহ",
          "arabic": "لَا إِلٰهَ إِلَّا اللهُ",
          "meaning": "আল্লাহ ছাড়া কোনো সত্য ইলাহ নেই।",
          "Fazilat":
              "এটি সর্বোত্তম জিকির। আল্লাহ ছাড়া কোনো সত্য উপাস্য নেই—একথা স্বীকার করাই মূল ইবাদত।",
          "ref": "[তিরমিযী: ৫/৪৬২]",
          "target": "10"
        },
        {
          "title": "সুবহানাল মালিকিল কুদ্দুস",
          "arabic": "سُبْحَانَ الْمَلِكِ الْقُدُّوسِ",
          "meaning":
              "মহা পবিত্র রাজাধিরাজ আল্লাহর পবিত্রতা ঘোষণা করছি। (যিনি সব দোষ-ত্রুটি থেকে মুক্ত)।",
          "Fazilat":
              "এটি পাঠ করা রাসুলুল্লাহ (সা.)-এর সুন্নাহ। তিনি বেতের নামাজের সালাম ফেরানোর পর উচ্চস্বরে তিনবার এটি বলতেন এবং তৃতীয়বার একটু টেনে দীর্ঘস্বরে বলতেন।",
          "ref": "[সুনানে নাসায়ি: ১৭৩২]",
          "target": "10"
        },
        {
          "title":
              "আল্লাহুম্মা ইন্নী আউযুবিকা মিন দীক্বিদ্দুনিয়া ওয়া দীক্বি ইয়াওমিল ক্বিয়ামাহ।",
          "arabic":
              "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ ضِيقِ الدُّنْيَا وَضِيقِ يَوْمِ الْقِيَامَةِ",
          "meaning":
              "হে আল্লাহ! আমি আপনার কাছে দুনিয়ার সংকীর্ণতা (বিপদ-আপদ) এবং কিয়ামত দিবসের সংকীর্ণতা (কঠিন অবস্থা) থেকে আশ্রয় প্রার্থনা করছি।",
          "Fazilat":
              "যারা দুনিয়ার অভাব-অনটন বা মানসিক চাপে ভুগছেন, তাদের জন্য এটি মহৌষধ। এটি পাঠ করলে আল্লাহ দুনিয়ার পথ সহজ করে দেন এবং পরকালের কঠিন হাশরের ময়দানে প্রশান্তি দান করেন।",
          "ref": "[সুনানে আবু দাউদ: ৭৬৬]",
          "target": "10"
        },
        {
          "title":
              "আল্লাহুম্মা ইন্নী যলামতু নাফসী যুলমান কাসীরাও ওয়ালা ইয়াগফিরুয যুনূবা ইল্লা আনতা, ফাগফিরলী মাগফিরাতাম মিন ইনদিকা ওয়ারহামনী, ইন্নাকা আনতাল গাফুরুর রাহীম।",
          "arabic":
              "اللَّهُمَّ إِنِّي ظَلَمْتُ نَفْسِي ظُلْمًا كَثِيرًا، وَلَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ، فَاغْفِرْ لِي مَغْفِرَةً مِنْ عِنْدِكَ، وَارْحَمْنِي إِنَّكَا أَنْتَ الْغَفُورُ الرَّحِيمُ",
          "meaning":
              "হে আল্লাহ! আমি আমার নিজের ওপর অনেক জুলুম করেছি। আর আপনি ছাড়া গুনাহ ক্ষমা করার আর কেউ নেই। অতএব আপনার পক্ষ থেকে আমাকে ক্ষমা করুন এবং আমার ওপর দয়া করুন। নিশ্চয়ই আপনি পরম ক্ষমাশীল ও অতি দয়ালু।",
          "Fazilat":
              "হযরত আবু বকর (রা.) যখন নবীজি (সা.)-এর কাছে এমন একটি দোয়া চাইলেন যা তিনি নামাজে পড়তে পারেন, তখন নবীজি (সা.) এই দোয়াটি শিখিয়েছিলেন।",
          "ref": "[সহীহ বুখারী ও মুসলিম]",
          "target": "1"
        }
      ]
    },
    {
      "packageName": "জুম্মার দিনের আমল",
      "description":
      "শুক্রবার বা জুম্মার দিন মুমিনের জন্য একটি সাপ্তাহিক ঈদের দিন। এই দিনের আমলগুলোর সওয়াব ও গুরুত্ব অন্য দিনের তুলনায় অনেক বেশি।",
      "dhikrs": [
        {
          "title": "আল্লাহুম্মা সাল্লি আলা মুহাম্মাদিঁউ ওয়া আলা আলি মুহাম্মদ।",
          "arabic": "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِّ مُحَمَّدٍ",
          "meaning":
          "হে আল্লাহ! মুহাম্মদ (সা.) ও তাঁর পরিবারের ওপর রহমত বর্ষণ করুন।",
          "Fazilat": "জুম্মার দিনের আমল",
          "ref": "জুম্মার দিনের আমল",
          "target": "100"
        },
        {
          "title": "যুল জালালি ওয়াল ইকরম",
          "arabic": "ذُو الْجَلَالِ وَالْإِكْرَامِ",
          "meaning": "মহিমা ও সম্মানের অধিকারী",
          "Fazilat":
          "রাসূলুল্লাহ (সা.) বলেছেন, তোমরা 'ইয়া যাল জালালি ওয়াল ইকরম' নিয়মিত পাঠ করো (অর্থাৎ দোয়ার মধ্যে এটি বেশি বেশি আঁকড়ে ধরো)।",
          "ref": "[তিরমিযী]",
          "target": "33"
        },
        {
          "title": "আল-গাফুর (الغفور)",
          "arabic": "يَا غَفُورُ",
          "meaning": "পরম ক্ষমাশীল",
          "Fazilat":
          "জুম্মার নামাজের পর ১০০ বার পাঠ করলে গুনাহ মাফ হয় এবং অভাব দূর হয়।",
          "ref": "",
          "target": "100"
        },
        {
          "title":
          "দরুদে উম্মি:\nআল্লাহুম্মা সাল্লি আলা মুহাম্মাদিনিন নাবিয়্যিল উম্মিইয়্যি ওয়া আলা আলিহী ওয়া সাল্লিম তাসলীমা।",
          "arabic":
          "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ النَّبِيِّ الأُمِّيِّ وَعَلَى آلِهِ وَسَلِّمْ تَسْلِيمًا",
          "meaning":
          "হে আল্লাহ! আপনি উম্মি নবী মুহাম্মদ (সা.)-এর ওপর এবং তাঁর পরিবারের ওপর রহমত ও শান্তি বর্ষণ করুন।",
          "Fazilat":
          "অনেক আলেম ও বুজুর্গগণের মতে, যে ব্যক্তি জুমার দিন আসর নামাজের পর নিজ স্থান থেকে ওঠার আগে এই দরুদটি ৮০ বার পাঠ করবে, আল্লাহ তাআলা তার ৮০ বছরের গুনাহ মাফ করে দেবেন এবং তার আমলনামায় ৮০ বছরের ইবাদতের সওয়াব লিখে দেবেন।",
          "ref": "Unkonwn",
          "target": "80"
        }
      ]
    }
  ];

  static const List<Map<String, dynamic>> specialDhikrPackage = [
    {
      "packageName": "আসমাউল হুসনা (আল্লাহর ৯৯ নাম)",
      "description":
          "আল্লাহর নামগুলোর অর্থ বুঝলে তাঁর ক্ষমতা, দয়া এবং মহত্ত্ব সম্পর্কে জ্ঞান বাড়ে। এটি একজন বান্দার অন্তরে আল্লাহর প্রতি ভয় ও ভালোবাসা তৈরি করে, যা ঈমানকে দৃঢ় করে।",
      "dhikrs": [
        {
          "title": "আর-রাহমান (الرحمن) ",
          "arabic": "يَا رَحْمَانُ ",
          "meaning": "পরম দয়ালু ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "33"
        },
        {
          "title": "আর-রাহীম (الرحيم) ",
          "arabic": "يَا رَحِيمُ ",
          "meaning": "অতিশয় মেহেরবান ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "34"
        },
        {
          "title": "আল-মালিক (الملك) ",
          "arabic": "يَا مَلِكُ ",
          "meaning": "সর্বাধিপতি ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "35"
        },
        {
          "title": "আল-কুদ্দুস (القدوس) ",
          "arabic": "يَا قُدُّوسُ ",
          "meaning": "নিষ্কলঙ্ক, অতি পবিত্র ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "36"
        },
        {
          "title": "আস-সালাম (السلام) ",
          "arabic": "يَا سَلَامُ ",
          "meaning": "শান্তি দানকারী ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "37"
        },
        {
          "title": "আল-মুমিন (المؤمن) ",
          "arabic": "يَا مُؤْمِنُ ",
          "meaning": "নিরাপত্তা দানকারী ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "38"
        },
        {
          "title": "আল-মুহাইমিন (المهيمن) ",
          "arabic": "يَا مُهَيْمِنُ ",
          "meaning": "রক্ষণাবেক্ষণকারী ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "39"
        },
        {
          "title": "আল-আযীয (العزيز) ",
          "arabic": "يَا عَزِيزُ ",
          "meaning": "মহা পরাক্রমশালী ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "40"
        },
        {
          "title": "আল-জাব্বার (الجبار) ",
          "arabic": "يَا جَبَّارُ ",
          "meaning": "দুর্নিবার, মহাপ্রতাপশালী ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "41"
        },
        {
          "title": "আল-মুতাকাব্বির (المتكبر) ",
          "arabic": "يَا مُتَكَبِّرُ ",
          "meaning": "সর্বশ্রেষ্ঠ, অহংকারের অধিকারী ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "42"
        },
        {
          "title": "আল-খালিক (الخالق) ",
          "arabic": "يَا خَالِقُ ",
          "meaning": "সৃষ্টিকর্তা ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "43"
        },
        {
          "title": "আল-বারী (البارئ) ",
          "arabic": "يَا بَارِئُ ",
          "meaning": "উদ্ভাবক ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "44"
        },
        {
          "title": "আল-মুসাব্বির (المصور) ",
          "arabic": "يَا مُصَوِّرُ ",
          "meaning": "আকৃতি দানকারী ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "45"
        },
        {
          "title": "আল-গাফফার (الغفار) ",
          "arabic": "يَا غَفَّارُ ",
          "meaning": "মহা ক্ষমাশীল ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "46"
        },
        {
          "title": "আল-কাহহার (القهار) ",
          "arabic": "يَا قَهَّارُ ",
          "meaning": "কঠোর দমনকারী ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "47"
        },
        {
          "title": "আল-ওয়াহহাব (الوهاب) ",
          "arabic": "يَا وَهَّابُ ",
          "meaning": "মহা দানকারী ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "48"
        },
        {
          "title": "আর-রাযযাক (الرزاق) ",
          "arabic": "يَا رَزَّاقُ ",
          "meaning": "রিজিক দানকারী ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "49"
        },
        {
          "title": "আল-ফাত্তাহ (الفتاح) ",
          "arabic": "يَا فَتَّاحُ ",
          "meaning": "বিজয়দানকারী ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "50"
        },
        {
          "title": "আল-আলীম (العليم) ",
          "arabic": "يَا عَلِيمُ ",
          "meaning": "সর্বজ্ঞ ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "51"
        },
        {
          "title": "আল-কাবিদ (القابض) ",
          "arabic": "يَا قَابِضُ ",
          "meaning": "সংকোচনকারী ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "52"
        },
        {
          "title": "আল-বাসিত (الباسط) ",
          "arabic": "يَا بَاسِطُ ",
          "meaning": "সম্প্রসারণকারী ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "53"
        },
        {
          "title": "আল-খাফিদ (الخافض) ",
          "arabic": "يَا خَافِضُ ",
          "meaning": "অবনতকারী ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "54"
        },
        {
          "title": "আর-রাফি (الرافع) ",
          "arabic": "يَا رَافِعُ ",
          "meaning": "উন্নতকারী ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "55"
        },
        {
          "title": "আল-মুইয (المعز) ",
          "arabic": "يَا مُعِزُّ ",
          "meaning": "সম্মান দানকারী ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "56"
        },
        {
          "title": "আল-মুযিল (المذل) ",
          "arabic": "يَا مُذِلُّ ",
          "meaning": "লাঞ্ছিতকারী ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "57"
        },
        {
          "title": "আস-সামি (السميع) ",
          "arabic": "يَا سَمِيعُ ",
          "meaning": "সর্বশ্রোতা ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "58"
        },
        {
          "title": "আল-বাসীর (البصير) ",
          "arabic": "يَا بَصِيرُ ",
          "meaning": "সর্বদ্রষ্টা ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "59"
        },
        {
          "title": "আল-হাকাম (الحكم) ",
          "arabic": "يَا حَكَمُ ",
          "meaning": "অটল বিচারক ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "60"
        },
        {
          "title": "আল-আদল (العدل) ",
          "arabic": "يَا عَدْلُ ",
          "meaning": "পরম ন্যায়বিচারক ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "61"
        },
        {
          "title": "আল-লতীফ (اللطيف) ",
          "arabic": "يَا لَطِيفُ ",
          "meaning": "অতি সূক্ষ্মদর্শী ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "62"
        },
        {
          "title": "আল-খাবীর (الخبير) ",
          "arabic": "يَا خَبِيرُ ",
          "meaning": "মহা সম্যক অবগত ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "63"
        },
        {
          "title": "আল-হালীম (الحليم) ",
          "arabic": "يَا حَلِيمُ ",
          "meaning": "অত্যন্ত ধৈর্যশীল ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "64"
        },
        {
          "title": "আল-আযীম (العظيم) ",
          "arabic": "يَا عَظِيمُ ",
          "meaning": "সর্বশ্রেষ্ঠ ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "65"
        },
        {
          "title": "আল-গাফুর (الغفور) ",
          "arabic": "يَا غَفُورُ ",
          "meaning": "পরম ক্ষমাশীল ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "66"
        },
        {
          "title": "আশ-শাকুর (الشكور) ",
          "arabic": "يَا شَكُورُ ",
          "meaning": "গুণগ্রাহী ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "67"
        },
        {
          "title": "আল-আলী (العلي) ",
          "arabic": "يَا عَلِيُّ ",
          "meaning": "উচ্চ মর্যাদাশীল ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "68"
        },
        {
          "title": "আল-কাবীর (الكبير) ",
          "arabic": "يَا كَبِيرُ ",
          "meaning": "সুমহান ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "69"
        },
        {
          "title": "আল-হাফীয (الحفيظ) ",
          "arabic": "يَا حَفِيظُ ",
          "meaning": "সংরক্ষণকারী ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "70"
        },
        {
          "title": "আল-মুকীত (المقيت) ",
          "arabic": "يَا مُقِيتُ ",
          "meaning": "আহার্য দানকারী ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "71"
        },
        {
          "title": "আল-হাসীব (الحسيب) ",
          "arabic": "يَا حَسِيبُ ",
          "meaning": "হিসাব গ্রহণকারী ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "72"
        },
        {
          "title": "আল-জালীল (الجليل) ",
          "arabic": "يَا جَلِيلُ ",
          "meaning": "গৌরবান্বিত ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "73"
        },
        {
          "title": "আল-কারীম (الكريم) ",
          "arabic": "يَا كَرِيمُ ",
          "meaning": "মহা দয়ালু ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "74"
        },
        {
          "title": "আর-রাকীব (الرقيب) ",
          "arabic": "يَا رَقِيبُ ",
          "meaning": "তত্ত্বাবধায়ক ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "75"
        },
        {
          "title": "আল-মুজিব (المجيب) ",
          "arabic": "يَا مُجِيبُ ",
          "meaning": "প্রার্থনা কবুলকারী ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "76"
        },
        {
          "title": "আল-ওয়াসি (الواسع) ",
          "arabic": "يَا وَاسِعُ ",
          "meaning": "অসীম প্রাচুর্যের অধিকারী ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "77"
        },
        {
          "title": "আল-হাকীম (الحكيم) ",
          "arabic": "يَا حَكِيمُ ",
          "meaning": "পরম প্রজ্ঞাময় ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "78"
        },
        {
          "title": "আল-ওয়াদুদ (الودود) ",
          "arabic": "يَا وَدُودُ ",
          "meaning": "মমতাময়, প্রেমময় ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "79"
        },
        {
          "title": "আল-মাজীদ (المجيد) ",
          "arabic": "يَا مَجِيدُ ",
          "meaning": "মহা গৌরবান্বিত ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "80"
        },
        {
          "title": "আল-বাইস (الباعث) ",
          "arabic": "يَا بَاعِثُ ",
          "meaning": "পুনরুত্থানকারী ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "81"
        },
        {
          "title": "আশ-শাহীদ (الشهيد) ",
          "arabic": "يَا شَهِيدُ ",
          "meaning": "সর্বদর্শী সাক্ষী ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "82"
        },
        {
          "title": "আল-হাক্ক (الحق) ",
          "arabic": "يَا حَقُّ ",
          "meaning": "পরম সত্য ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "83"
        },
        {
          "title": "আল-ওয়াকীল (الوكيل) ",
          "arabic": "يَا وَكِيلُ ",
          "meaning": "পরম কর্মবিধায়ক ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "84"
        },
        {
          "title": "আল-কাবীয়ু (القوي) ",
          "arabic": "يَا قَوِيُّ ",
          "meaning": "মহা শক্তিশালী ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "85"
        },
        {
          "title": "আল-মাতীন (المتين) ",
          "arabic": "يَا مَتِينُ ",
          "meaning": "সুদৃঢ় ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "86"
        },
        {
          "title": "আল-ওয়ালী (الولي) ",
          "arabic": "يَا وَلِيُّ ",
          "meaning": "অভিভাবক ও সাহায্যকারী ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "87"
        },
        {
          "title": "আল-হামীদ (الحميد) ",
          "arabic": "يَا حَمِيدُ ",
          "meaning": "মহা প্রশংসিত ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "88"
        },
        {
          "title": "আল-মুহসী (المحصي) ",
          "arabic": "يَا مُحْصِي ",
          "meaning": "সবকিছুর হিসাব রক্ষাকারী ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "89"
        },
        {
          "title": "আল-মুবদী (المبدئ) ",
          "arabic": "يَا مُبْدِئُ ",
          "meaning": "প্রথমবার সৃষ্টিকর্তা ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "90"
        },
        {
          "title": "আল-মুঈদ (المعيد) ",
          "arabic": "يَا مُعِيدُ ",
          "meaning": "পুনরায় সৃষ্টিকর্তা ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "91"
        },
        {
          "title": "আল-মুহয়ী (المحيي) ",
          "arabic": "يَا مُحْيِي ",
          "meaning": "জীবন দানকারী ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "92"
        },
        {
          "title": "আল-মুমীত (المميت) ",
          "arabic": "يَا مُمِيتُ ",
          "meaning": "মৃত্যু দানকারী ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "93"
        },
        {
          "title": "আল-হাইয়্যু (الحي) ",
          "arabic": "يَا حَيُّ ",
          "meaning": "চিরঞ্জীব ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "94"
        },
        {
          "title": "আল-কাইয়্যুম (القيوم) ",
          "arabic": "يَا قَيُّومُ ",
          "meaning": "নিজে বিদ্যমান থেকে সবকিছুর ধারক ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "95"
        },
        {
          "title": "আল-ওয়াজিদ (الواجد) ",
          "arabic": "يَا وَاجِدُ ",
          "meaning": "অভাবহীন ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "96"
        },
        {
          "title": "আল-মাজিদ (الماجد) ",
          "arabic": "يَا مَاجِدُ ",
          "meaning": "সুউচ্চ মর্যাদার অধিকারী ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "97"
        },
        {
          "title": "আল-ওয়াহিদ (الواحد) ",
          "arabic": "يَا وَاحِدُ ",
          "meaning": "এক ও অদ্বিতীয় ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "98"
        },
        {
          "title": "আল-আহাদ (الأحد) ",
          "arabic": "يَا أَحَدُ ",
          "meaning": "এক ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "99"
        },
        {
          "title": "আস-সামাদ (الصمد) ",
          "arabic": "يَا صَمَدُ ",
          "meaning": "অমুখাপেক্ষী ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "100"
        },
        {
          "title": "আল-কাদির (القادر) ",
          "arabic": "يَا قَادِرُ ",
          "meaning": "সর্বশক্তিমান ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "101"
        },
        {
          "title": "আল-মুকতাদির (المقتدر) ",
          "arabic": "يَا مُقْتَدِرُ ",
          "meaning": "প্রবল শক্তিশালী ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "102"
        },
        {
          "title": "আল-মুকাদ্দিম (المقدم) ",
          "arabic": "يَا مُقَدِّمُ ",
          "meaning": "অগ্রসরকারী ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "103"
        },
        {
          "title": "আল-মুআখখির (المؤخر) ",
          "arabic": "يَا مُؤَخِّرُ ",
          "meaning": "বিলম্বকারী ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "104"
        },
        {
          "title": "আল-আউয়াল (الأول) ",
          "arabic": "يَا أَوَّلُ ",
          "meaning": "অনাদি ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "105"
        },
        {
          "title": "আল-আখির (الآخر) ",
          "arabic": "يَا آخِرُ ",
          "meaning": "অনন্ত ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "106"
        },
        {
          "title": "আজ-জাহির (الظاهر) ",
          "arabic": "يَا ظَاهِرُ ",
          "meaning": "প্রকাশ্য ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "107"
        },
        {
          "title": "আল-বাতিন (الباطن) ",
          "arabic": "يَا بَاطِنُ ",
          "meaning": "অপ্রকাশ্য বা গুপ্ত ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "108"
        },
        {
          "title": "আল-ওয়ালী (الوالي) ",
          "arabic": "يَا وَالِي ",
          "meaning": "পরিচালক ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "109"
        },
        {
          "title": "আল-মুতাআলী (المتعالي) ",
          "arabic": "يَا مُتَعَالِي ",
          "meaning": "সর্বোচ্চ মর্যাদাবান ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "110"
        },
        {
          "title": "আল-বার্ (البر) ",
          "arabic": "يَا بَرُّ ",
          "meaning": "পরম উপকারী ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "111"
        },
        {
          "title": "আত-তাওয়াব (التواب) ",
          "arabic": "يَا تَوَّابُ ",
          "meaning": "তওবা কবুলকারী ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "112"
        },
        {
          "title": "আল-মুনতাকিম (المنتقم) ",
          "arabic": "يَا مُنْتَقِمُ ",
          "meaning": "প্রতিশোধ গ্রহণকারী ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "113"
        },
        {
          "title": "আল-আফুব্বু (العفو) ",
          "arabic": "يَا عَفُوُّ ",
          "meaning": "পরম ক্ষমাশীল ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "114"
        },
        {
          "title": "আর-রাউফ (الرؤوف) ",
          "arabic": "يَا رَؤُوفُ ",
          "meaning": "অতি দয়ালু ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "115"
        },
        {
          "title": "মালিকুল মুলক (مالك الملك) ",
          "arabic": "يَا مَالِكَ الْمُلْكِ ",
          "meaning": "সর্বভৌম ক্ষমতার অধিকারী ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "116"
        },
        {
          "title": "যুল জালালি ওয়াল ইকরম (ذو الجلال والإكرام) ",
          "arabic": "يَا ذَا الْجَلَالِ وَالْإِكْرَامِ ",
          "meaning": "মহিমা ও সম্মানের অধিকারী ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "117"
        },
        {
          "title": "আল-মুকসিত (المقسط) ",
          "arabic": "يَا مُقْسِطُ ",
          "meaning": "ন্যায়পরায়ণ ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "118"
        },
        {
          "title": "আল-জামি (الجامع) ",
          "arabic": "يَا جَامِعُ ",
          "meaning": "একত্রকারী ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "119"
        },
        {
          "title": "আল-গণি (الغني) ",
          "arabic": "يَا غَنِيُّ ",
          "meaning": "ঐশ্বর্যের অধিকারী ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "120"
        },
        {
          "title": "আল-মুগনী (المغني) ",
          "arabic": "يَا مُغْنِي ",
          "meaning": "প্রাচুর্য দানকারী ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "121"
        },
        {
          "title": "আল-মানি (المانع) ",
          "arabic": "يَا مَانِعُ ",
          "meaning": "প্রতিরোধকারী ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "122"
        },
        {
          "title": "আদ-দার (الضار) ",
          "arabic": "يَا ضَارُّ ",
          "meaning": "ক্ষতিসাধনকারী ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "123"
        },
        {
          "title": "আন-নাফি (النافع) ",
          "arabic": "يَا نَافِعُ ",
          "meaning": "কল্যাণকারী ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "124"
        },
        {
          "title": "আন-নূর (النور) ",
          "arabic": "يَا نُورُ ",
          "meaning": "জ্যোতি ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "125"
        },
        {
          "title": "আল-হাদী (الهادي) ",
          "arabic": "يَا هَادِي ",
          "meaning": "পথপ্রদর্শক ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "126"
        },
        {
          "title": "আল-বাদী (البديع) ",
          "arabic": "يَا بَدِيعُ ",
          "meaning": "অপূর্ব সৃজনকারী ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "127"
        },
        {
          "title": "আল-বাকী (الباقي) ",
          "arabic": "يَا بَاقِي ",
          "meaning": "চিরস্থায়ী ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "128"
        },
        {
          "title": "আল-ওয়ারিস (الوارث) ",
          "arabic": "يَا وَارِثُ ",
          "meaning": "উত্তরাধিকারী ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "129"
        },
        {
          "title": "আর-রাশীদ (الرشيد) ",
          "arabic": "يَا رَشِيدُ ",
          "meaning": "সঠিক পথপ্রদর্শক ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "130"
        },
        {
          "title": "আস-সাবুর (الصبور) ",
          "arabic": "يَا صَبُورُ ",
          "meaning": "অত্যধিক ধৈর্যশীল ",
          "Fazilat":
              "আল্লাহ তাআলা কুরআনে নির্দেশ দিয়েছেন, আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে সব নামেই তাঁকে ডাকো। (সূরা আল-আরাফ: ১৮০)",
          "ref": "",
          "target": "131"
        }
      ]
    },
    {
      "packageName": "ক্ষমা ও রহমত পাওয়ার জন্য",
      "description":
          "আল্লাহর গুণবাচক নাম বা আসমাউল হুসনা (الأسماء الحسنى) হলো তাঁর পবিত্র সত্তা ও গুণাবলীর পরিচায়ক ৯৯টি নাম, যা মানুষের জন্য মহান সৃষ্টিকর্তাকে চেনার সর্বোত্তম মাধ্যম।",
      "dhikrs": [
        {
          "title": "আর-রাহমান (الرحمن)",
          "arabic": "يَا رَحْمَانُ",
          "meaning": "পরম দয়ালু",
          "Fazilat":
              "প্রতি ফরজ নামাজের পর ১০০ বার পাঠ করলে মন থেকে কঠোরতা ও গাফিলতি দূর হয়।",
          "ref": "",
          "target": "100"
        },
        {
          "title": "আর-রাহীম (الرحيم)",
          "arabic": "يَا رَحِيمُ",
          "meaning": "অতিশয় মেহেরবান",
          "Fazilat":
              "প্রতিদিন ১০০ বার পাঠ করলে দুনিয়ার যাবতীয় বিপদ-আপদ থেকে রক্ষা পাওয়া যায়।",
          "ref": "",
          "target": "100"
        },
        {
          "title": "আল-গাফফার (الغفار)",
          "arabic": "يَا غَفَّارُ",
          "meaning": "মহা ক্ষমাশীল",
          "Fazilat":
              "জুম্মার নামাজের পর ১০০ বার পাঠ করলে আল্লাহ সব গুনাহ মাফ করে দেন।",
          "ref": "",
          "target": "100"
        },
        {
          "title": "আল-ওয়াদুদ (الودود)",
          "arabic": "يَا وَدُودُ",
          "meaning": "মমতাময়, প্রেমময়",
          "Fazilat":
              "১০০০ বার পাঠ করে খাবারের ওপর ফুঁ দিয়ে স্বামী-স্ত্রী একসাথে খেলে ভালোবাসা বৃদ্ধি পায়।",
          "ref": "",
          "target": "1000"
        },
        {
          "title": "আল-গাফুর (الغفور)",
          "arabic": "يَا غَفُورُ",
          "meaning": "পরম ক্ষমাশীল",
          "Fazilat":
              "অধিক পাঠে শরীর ও মনের রোগব্যাধি দূর হয় এবং পাপ মোচন হয়।",
          "ref": "",
          "target": "100"
        },
        {
          "title": "আর-রাউফ (الرؤوف)",
          "arabic": "يَا رَؤُوفُ",
          "meaning": "অতি দয়ালু",
          "Fazilat":
              "প্রতিদিন ১০ বার পাঠ করলে সব সৃষ্টির ওপর ভালোবাসা ও দয়া জন্মাবে।",
          "ref": "",
          "target": "10"
        }
      ]
    },
    {
      "packageName": "জ্ঞান ও হিদায়াত পাওয়ার জন্য",
      "description":
          "আল্লাহর গুণবাচক নাম বা আসমাউল হুসনা (الأسماء الحسنى) হলো তাঁর পবিত্র সত্তা ও গুণাবলীর পরিচায়ক ৯৯টি নাম, যা মানুষের জন্য মহান সৃষ্টিকর্তাকে চেনার সর্বোত্তম মাধ্যম।",
      "dhikrs": [
        {
          "title": "আল-আলীম (العليم)",
          "arabic": "يَا عَلِيمُ",
          "meaning": "সর্বজ্ঞ",
          "Fazilat":
              "এটি বেশি পাঠ করলে আল্লাহ জ্ঞানের দরজা খুলে দেন এবং স্মরণশক্তি বৃদ্ধি পায়।",
          "ref": "",
          "target": "100"
        },
        {
          "title": "আল-হাদী (الهادي)",
          "arabic": "يَا هَادِي",
          "meaning": "পথপ্রদর্শক",
          "Fazilat":
              "হাত তুলে আসমানের দিকে চেয়ে জিকির করলে আল্লাহ পূর্ণ হিদায়াত নসিব করেন।",
          "ref": "",
          "target": "20"
        },
        {
          "title": "আল-হাকীম ",
          "arabic": "يَا حَكِيمُ",
          "meaning": "পরম প্রজ্ঞাময়",
          "Fazilat":
              "নিয়মিত পাঠ করলে কাজে স্থিরতা আসে এবং সিদ্ধান্তে ভুল হওয়ার সম্ভাবনা কমে।",
          "ref": "",
          "target": "100"
        },
        {
          "title": "আল-খাবীর (الخبير)",
          "arabic": "يَا خَبِيرُ",
          "meaning": "মহা সম্যক অবগত",
          "Fazilat":
              "৭ দিন পর্যন্ত পাঠ করলে অজানা বা গোপন কোনো সংবাদ স্বপ্নে জানতে পারা যায়।",
          "ref": "",
          "target": "100"
        },
        {
          "title": "ইয়া মুইজ্জু।",
          "arabic": "يَا مُعِزُّ",
          "meaning":
              "যিনি সম্মান দান করেন। অর্থাৎ, তিনি যাকে ইচ্ছা দুনিয়া ও আখিরাতে সম্মানিত করেন এবং উচ্চ মর্যাদা দান করেন।",
          "Fazilat":
              "কোনো ব্যক্তি যদি মানুষের কাছে তুচ্ছতাচ্ছিল্য বা অবহেলার শিকার হয়, তবে নিয়মিত 'ইয়া মুইজ্জু' পাঠ করলে আল্লাহ তার ইজ্জত ও সম্মান বাড়িয়ে দেন।",
          "ref": "",
          "target": "140"
        }
      ]
    },
    {
      "packageName": "বিপদ মুক্তি ও নিরাপত্তা পাওয়ার জন্য",
      "description":
          "আল্লাহর গুণবাচক নাম বা আসমাউল হুসনা (الأسماء الحسنى) হলো তাঁর পবিত্র সত্তা ও গুণাবলীর পরিচায়ক ৯৯টি নাম, যা মানুষের জন্য মহান সৃষ্টিকর্তাকে চেনার সর্বোত্তম মাধ্যম।",
      "dhikrs": [
        {
          "title": "আল-হাফীয (الحفيظ)",
          "arabic": "يَا حَفِيظُ",
          "meaning": "সংরক্ষণকারী",
          "Fazilat":
              "যেকোনো বিপদে বা সফরের সময় এটি পাঠ করলে আল্লাহ হেফাজত করেন।",
          "ref": "",
          "target": "100"
        },
        {
          "title": "আস-সালাম (السلام)",
          "arabic": "يَا سَلَامُ",
          "meaning": "শান্তি দানকারী",
          "Fazilat":
              "অসুস্থ ব্যক্তির পাশে দাঁড়িয়ে ১৬০ বার পাঠ করলে আল্লাহ তাকে দ্রুত সুস্থতা দান করেন।",
          "ref": "",
          "target": "160"
        },
        {
          "title": "আল-ওয়াকীল",
          "arabic": "يَا وَكِيلُ",
          "meaning": "পরম কর্মবিধায়ক",
          "Fazilat":
              "ভয়ংকর ঝড় বা বৃষ্টির সময় পাঠ করলে আল্লাহর রহমতে বিপদ থেকে রক্ষা পাওয়া যায়।",
          "ref": "",
          "target": "66"
        },
        {
          "title": "আল-মুমিন (المؤمن)",
          "arabic": "يَا مُؤْمِنُ",
          "meaning": "নিরাপত্তা দানকারী",
          "Fazilat":
              "ভয়-ভীতির সময় এটি পাঠ করলে আল্লাহ শত্রু ও অনিষ্ট থেকে নিরাপত্তা দান করেন।",
          "ref": "",
          "target": "136"
        },
        {
          "title": "আল-মুহাইমিন (المهيمن)",
          "arabic": "يَا مُهَيْمِنُ",
          "meaning": "রক্ষণাবেক্ষণকারী",
          "Fazilat":
              "গোসল করার পর ২ রাকাত নামাজ পড়ে ১০০ বার পাঠ করলে অন্তরের নূর বৃদ্ধি পায়।",
          "ref": "",
          "target": "100"
        },
        {
          "title": "আস-সাবুর (الصبور)",
          "arabic": "يَا صَبُورُ",
          "meaning": "অত্যধিক ধৈর্যশীল",
          "Fazilat":
              "সূর্যোদয়ের আগে ১০০ বার পাঠ করলে সারাদিন কোনো বিপদ গ্রাস করবে না।",
          "ref": "",
          "target": "100"
        },
        {
          "title": "ইয়া মুতাকাব্বির্।",
          "arabic": "يَا مُتَكَبِّرُ",
          "meaning":
              "যিনি সমস্ত ত্রুটি-বিচ্যুতি থেকে মুক্ত এবং অহংকার যাঁর একমাত্র ভূষণ। সৃষ্টিজগতের কেউ এই নামের অংশীদার হতে পারে না।",
          "Fazilat":
              "অনেক বুজুর্গ আলেমের মতে, স্ত্রী সহবাসের আগে এই নামটি পাঠ করলে আল্লাহর রহমতে নেক ও সৎ সন্তান লাভের সম্ভাবনা থাকে।",
          "ref": "",
          "target": "100"
        },
        {
          "title": "ইয়া বাক্বী।",
          "arabic": "يَا بَاقِي",
          "meaning": "চিরস্থায়ী বা অবিনশ্বর",
          "Fazilat":
              "জুমার রাতে (বৃহস্পতিবার দিবাগত রাত) ১০০০ বার এই নামটির জিকির করলে আল্লাহর রহমতে ওই ব্যক্তির সমস্ত নেক আমল কবুল হয় এবং তার ঈমান মজবুত হয়।",
          "ref": "",
          "target": "1000"
        },
        {
          "title": "ইয়া বাদী-উ।",
          "arabic": "يَا بَدِيعُ",
          "meaning": "অপূর্ব কৌশলে সৃষ্টিকারী বা অতুলনীয়",
          "Fazilat":
              "প্রতিদিন মাগরিবের পর এই নামের জিকির করলে চোর-ডাকাত এবং শত্রুর অনিষ্ট থেকে রক্ষা পাওয়া যায়।",
          "ref": "",
          "target": "100"
        }
      ]
    },
    {
      "packageName": "রিযিক ও বরকত পাওয়ার জন্য",
      "description":
          "আল্লাহর গুণবাচক নাম বা আসমাউল হুসনা (الأسماء الحسنى) হলো তাঁর পবিত্র সত্তা ও গুণাবলীর পরিচায়ক ৯৯টি নাম, যা মানুষের জন্য মহান সৃষ্টিকর্তাকে চেনার সর্বোত্তম মাধ্যম।",
      "dhikrs": [
        {
          "title": "আর-রাযযাক (الرزاق)",
          "arabic": "يَا رَزَّاقُ",
          "meaning": "রিজিক দানকারী",
          "Fazilat":
              "সকালের নামাজের আগে ঘরের চার কোণায় ১০ বার করে পাঠ করলে রিজিকে অভাব দূর হয়।",
          "ref": "",
          "target": "40"
        },
        {
          "title": "আল-ওয়াহহাব (الوهاب)",
          "arabic": "يَا وَهَّابُ",
          "meaning": "মহা দানকারী",
          "Fazilat":
              "চাশতের নামাজের সেজদায় গিয়ে ৪০ বার পাঠ করলে অভাব-অনটন দূর হয়।",
          "ref": "",
          "target": "40"
        },
        {
          "title": "আল-গণি (الغني)",
          "arabic": "يَا غَنِيُّ",
          "meaning": "ঐশ্বর্যের অধিকারী",
          "Fazilat":
              "রোগ মুক্তির জন্য এবং অভাব দূর করার জন্য শরীরের ওপর হাত রেখে এটি জিকির করা উপকারী।",
          "ref": "",
          "target": "70"
        },
        {
          "title": "আল-মুগনী (المغني)",
          "arabic": "يَا مُغْنِي",
          "meaning": "প্রাচুর্য দানকারী",
          "Fazilat":
              "বেশি বেশি পাঠ করলে মানুষের কৃপণতা দূর হয় এবং রিজিকে প্রশস্ততা আসে।",
          "ref": "",
          "target": "100"
        },
        {
          "title": "আল-বাসিত (الباسط)",
          "arabic": "يَا بَاسِطُ",
          "meaning": "সম্প্রসারণকারী",
          "Fazilat":
              "চাশতের নামাজের পর হাত তুলে ১০ বার পাঠ করে মুখে হাত বুলালে রিজিকে অভাব থাকে না।",
          "ref": "",
          "target": "10"
        },
        {
          "title": "আল-মালিক",
          "arabic": "يَا مَلِكُ",
          "meaning": "সর্বাধিপতি",
          "Fazilat":
              "ফজরের নামাজের পর নিয়মিত পাঠ করলে আল্লাহ তাকে সম্পদশালী ও স্বাবলম্বী করে দেন",
          "ref": "",
          "target": "121"
        },
        {
          "title": "আল-ফাত্তাহ (الفتاح)",
          "arabic": "يَا فَتَّاحُ",
          "meaning": "বিজয়দানকারী",
          "Fazilat":
              "ফজরের পর দুই হাত বুকের ওপর রেখে ৭১ বার পাঠ করলে অন্তরে হিদায়াত ও ঈমানের নূর আসে।",
          "ref": "",
          "target": "71"
        },
        {
          "title": "ইয়া ওয়াসি-উ।",
          "arabic": "يَا وَاسِعُ",
          "meaning":
              "অসীম প্রশস্ততার অধিকারী, যাঁর জ্ঞান, ক্ষমতা এবং রহমত সবকিছুর ওপর পরিব্যাপ্ত।",
          "Fazilat":
              "কেউ যদি অভাব-অনটনে থাকে, তবে এই নামটির জিকির করলে আল্লাহর রহমতে তার রিযিকের পথ প্রশস্ত হয় এবং সচ্ছলতা আসে।",
          "ref": "",
          "target": "100"
        },
        {
          "title": "ইয়া ওয়াহ্হাব।",
          "arabic": "يَا وَهَّابُ",
          "meaning": "মহাসাতা বা সবকিছুর দাতা",
          "Fazilat":
              "কেউ যদি চরম আর্থিক অনটনের মধ্যে থাকে, তবে এই নামটির জিকির করলে আল্লাহর রহমতে তার অভাব দূর হয়। বিশেষ করে চাশতের নামাজের সেজদায় গিয়ে ৪০ বার 'ইয়া ওয়াহ্হাব' পাঠ করা অভাব দূর করার জন্য অত্যন্ত কার্যকর একটি আমল।",
          "ref": "",
          "target": "100"
        }
      ]
    },
    {
      "packageName": "লাইলাতুল কদরের আমল ও দোয়াসমূহ",
      "description":
          "লাইলাতুল কদরের রাতের কিছু গুরুত্বপূর্ণ জিকির ও দোয়ার একটি তালিকা দেওয়া হয়েছে। এই দোয়াগুলো কেবল কদরের রাতে নয়, বরং যেকোনো সময়ই পাঠ করা অত্যন্ত সওয়াবের কাজ।",
      "dhikrs": [
        {
          "title": "সুবহান আল্লাহ্",
          "arabic": "سُبْحَانَ اللَّهِ",
          "meaning": "আল্লাহ অতি পবিত্র",
          "Fazilat":
              "প্রতিদিন ১০০ বার পাঠ করলে ১০০০ সওয়াব লেখা হয় এবং ১০০০ গুনাহ মাফ করা হয়।",
          "ref": "[সহীহ মুসলিম-৪/২০৭৩]",
          "target": "100"
        },
        {
          "title": "আলহামদুলিল্লাহ",
          "arabic": "الْحَمْدُ لِلَّهِ",
          "meaning": "সমস্ত প্রশংসা আল্লাহর।",
          "Fazilat":
              "এটি সর্বোত্তম দোয়া এবং কিয়ামতের দিন মিজানের পাল্লাকে নেকিতে ভারী করে দেয়।",
          "ref": "[তিরমিযী-৫/৪৬২]",
          "target": "100"
        },
        {
          "title": "লা ইলাহা ইল্লাল্লাহ",
          "arabic": "لَا إِلٰهَ إِلَّا اللهُ",
          "meaning": "আল্লাহ ছাড়া কোনো সত্য ইলাহ নেই।",
          "Fazilat":
              "এটি সর্বোত্তম জিকির। আল্লাহ ছাড়া কোনো সত্য উপাস্য নেই—একথা স্বীকার করাই মূল ইবাদত।",
          "ref": "[তিরমিযী: ৫/৪৬২]",
          "target": "100"
        },
        {
          "title": "আল্লাহু আকবার",
          "arabic": "اللَّهُ أَكْبَرُ",
          "meaning": "আল্লাহ সবচেয়ে মহান।",
          "Fazilat":
              "হাদিস অনুযায়ী, এটি মিজানের পাল্লাকে নেকি দিয়ে পূর্ণ করে দেযযেকোনো ভীতি বা বড় কোনো কাজের শুরুতে এটি পাঠ করলে অন্তরে প্রশান্তি ও আল্লাহর সাহায্য অনুভূত হয়।",
          "ref": "Unknown",
          "target": "100"
        },
        {
          "title": "আস্তাগফিরুল্লাহ",
          "arabic": "أَسْتَغْفِرُ اللَّهَ",
          "meaning": "আমি আল্লাহর নিকট ক্ষমা চাচ্ছি",
          "Fazilat":
              "রাসূলুল্লাহ (সা.) বলেছেন, যে ব্যক্তি নিয়মিত ইস্তিগফার করবে, আল্লাহ তাকে প্রতিটি সংকীর্ণতা (বিপদ) থেকে বের হওয়ার পথ করে দেবেন এবং তার প্রতিটি দুশ্চিন্তা দূর করে দেবেন।",
          "ref": "[আবু দাউদ]",
          "target": "100"
        },
        {
          "title": "লা হাওলা ওয়ালা কুয়্যাতা ইল্লা বিল্লাহ",
          "arabic": "لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ",
          "meaning":
              "আল্লাহর সাহায্য ছাড়া (পাপ থেকে) ফিরে থাকার কোনো উপায় নেই এবং (নেক কাজ করার) কোনো শক্তি নেই।",
          "Fazilat":
              "এটি পাঠ করলে আল্লাহ তাআলা কঠিন বিপদ ও দুশ্চিন্তা থেকে মুক্তি দেন। ৯৯টি রোগের ঔষধ হিসেবে এটিকে গণ্য করা হয়, যার মধ্যে ক্ষুদ্রতম হলো 'উদ্বেগ' বা 'দুশ্চিন্তা'।",
          "ref": "[সহীহ আল-বুখারী -১১/২১৩, সহীহ মুসলিম-৪/২০৭৬]",
          "target": "100"
        },
        {
          "title": "সুবহানাল্লাহি ওয়া বিহামদিহী, সুবহানাল্লাহিল আযীম ",
          "arabic":
              "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ، سُبْحَانَ اللَّهِ الْعَظِيمِ",
          "meaning":
              "আল্লাহর সপ্রশংস পবিত্রতা ঘোষণা করছি, মহান আল্লাহ অতি পবিত্র।",
          "Fazilat":
              "প্রতিদিন ১০০ বার 'সুবহানাল্লাহি ওয়া বিহামদিহী' পাঠ করলে সমুদ্রের ফেনা পরিমাণ গুনাহ থাকলেও তা ক্ষমা করা হয়।",
          "ref": " [সহীহ বুখারী: ১১/২১৩]",
          "target": "100"
        },
        {
          "title": "আল্লাহুম্মা আজিরনী মিনান নার",
          "arabic": "اللَّهُمَّ أَجِرْنِي مِنَ النَّارِ",
          "meaning": "হে আল্লাহ! আমাকে জাহান্নামের আগুন থেকে মুক্তি দিন",
          "Fazilat":
              "রাসূলুল্লাহ (সা.) বলেছেন, যদি কেউ মাগরিব বা ফজরের পর এই দোয়াটি ৭ বার পাঠ করে এবং ওই দিন বা রাতে তার মৃত্যু হয়, তবে আল্লাহ তাকে জাহান্নাম থেকে মুক্তির ফয়সালা লিখে দেন।",
          "ref": "[সুনানে আবু দাউদ: ৫০৭৯]",
          "target": "100"
        },
        {
          "title":
              "লা ইলাহা ইল্লাল্লাহু ওয়াহদাহু লা শারিকা লাহু, লাহুল মুলকু ওয়া লাহুল হামদু, ওয়া হুয়া আলা কুল্লি শাইয়িন কাদির।",
          "arabic":
              "لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ",
          "meaning":
              "আল্লাহ ছাড়া কোনো সত্য উপাস্য নেই, তিনি একক, তাঁর কোনো শরিক নেই। রাজত্ব একমাত্র তাঁরই এবং সমস্ত প্রশংসাও তাঁরই। তিনি সবকিছুর ওপর ক্ষমতাবান।",
          "Fazilat":
              "কিয়ামতের দিন তার চেয়ে উত্তম আমল আর কেউ আনতে পারবে না (যে তার চেয়ে বেশি পাঠ করেছে সে ছাড়া)।",
          "ref": "[সহীহ বুখারী ও মুসলিম]",
          "target": "100"
        },
        {
          "title": "লা ইলাহা ইল্লা আনতা সুবহানাকা ইন্নী কুনতু মিনায যালিমীন।",
          "arabic":
              "لَا إِلَٰهَ إِلَّا أَنْتَ سُبْحَانَكَ إِنِّي كُنْتُ مِنَ الظَّالِمِينَ",
          "meaning":
              "আপনি ছাড়া কোনো উপাস্য নেই, আপনি পবিত্র-মহান। নিশ্চয়ই আমি পাপিষ্ঠদের (অপরাধীদের) অন্তর্ভুক্ত হয়ে গেছি।",
          "Fazilat":
              "রাসুলুল্লাহ (সা.) বলেছেন, কোনো মুসলিম যদি কোনো বিপদে পড়ে এই দোয়া পাঠ করে, তবে আল্লাহ অবশ্যই তার দোয়া কবুল করবেন। কঠিন দুশ্চিন্তা বা মন খারাপের সময় এই দোয়াটি পাঠ করলে মনের মেঘ কেটে যায় এবং আল্লাহর রহমত অনুভূত হয়।",
          "ref": "[তিরমিজি: ৩৫০৫]",
          "target": "100"
        },
        {
          "title":
              "আল্লাহুম্মা ইন্নাকা 'আফুউন, তুহিব্বুল 'আফওয়া, ফাফু 'আন্নী।",
          "arabic":
              "اللَّهُمَّ إِنَّكَ عَفُوٌّ تُحِبُّ الْعَفْوَ فَاعْفُ عَنِّي",
          "meaning":
              "হে আল্লাহ! নিশ্চয়ই আপনি পরম ক্ষমাশীল, আপনি ক্ষমা করাকে পছন্দ করেন; অতএব আমাকে ক্ষমা করুন।",
          "Fazilat":
              "হযরত আয়েশা (রা.) রাসূলুল্লাহ (সা.)-কে জিজ্ঞেস করেছিলেন, হে আল্লাহর রাসূল! আমি যদি জানতে পারি যে কোন রাতটি লাইলাতুল কদর, তবে আমি সেই রাতে কী বলব? রাসূল (সা.) তাকে এই দোয়াটিই পড়তে বলেছিলেন।",
          "ref": "[তিরমিজি: ৩৫১৩]",
          "target": "100"
        }
      ]
    },
    {
      "packageName": "শরীরের প্রতিটি অঙ্গের নিরাপত্তা এবং সুস্থতা চাওয়া",
      "description": "তাসবিহে ফাতেমী",
      "dhikrs": [
        {
          "title":
              "আল্লাহুম্মা ‘আফিনি ফী বাদানি, আল্লাহুম্মা ‘আফিনি ফী সাম‘ই, আল্লাহুম্মা ‘আফিনি ফী বাসারী, লা ইলাহা ইল্লা আন্তা।",
          "arabic":
              "اللَّهُمَّ عَافِنِي فِي بَدَنِي، اللَّهُمَّ عَافِنِي فِي سَمْعِي، اللَّهُمَّ عَافِنِي فِي بَصَرِي، لَا إِلَهَ إِلَّا أَنْتَ",
          "meaning":
              "হে আল্লাহ! আপনি আমার শরীর সুস্থ রাখুন। হে আল্লাহ! আপনি আমার শ্রবণশক্তি (কান) নিরাপদ রাখুন। হে আল্লাহ! আপনি আমার দৃষ্টিশক্তি (চোখ) সুস্থ রাখুন। আপনি ছাড়া কোনো সত্য উপাস্য নেই।",
          "Fazilat":
              "এই দোয়ার মাধ্যমে শরীরের প্রতিটি অঙ্গের নিরাপত্তা এবং সুস্থতা চাওয়া হয়। বিশেষ করে বার্ধক্যে শ্রবণ ও দৃষ্টিশক্তি অটুট রাখতে এটি কার্যকর। রাসূলুল্লাহ (সা.)-এর সুন্নাহ: নবীজি (সা.) প্রতিদিন সকাল ও সন্ধ্যায় নিয়মিত এই দোয়াটি পাঠ করতেন।",
          "ref": "[আবু দাউদ: ৫০৯০, মুসনাদে আহমাদ: ২০৪৩০]",
          "target": "3"
        }
      ]
    }
  ];

  static const List<Map<String, dynamic>> duaPackage = [
    {
      "packageName": "আয়াতুল কুরসী (Ayatul Kursi)",
      "description":
          "রাসুলুল্লাহ (সা.) বলেছেন, যে ব্যক্তি প্রতি ফরয নামাযের পর আয়াতুল কুরসী পাঠ করবে, তার জান্নাতে প্রবেশের পথে মৃত্যু ছাড়া আর কোনো বাধা থাকবে না। (নাসায়ি)",
      "dhikrs": [
        {
          "title":
              "আল্লাহু লা ইলাহা ইল্লা হুওয়াল হাইয়্যুল কাইয়্যুম। লা তা'খুযুহু সিনাতুঁ ওয়ালা নাউম। লাহূ মা ফিসসামাওয়াতি ওয়ামা ফিল আরদ্। মান যাল্লাযী ইয়াশফাউ ইনদাহূ ইল্লা বি-ইযনিহ। ইয়া'লামু মা বাইনা আইদীহিম ওয়ামা খালফাহুম, ওয়ালা ইয়ুহীতূনা বিশাইয়িম্ মিন ইলমিহী ইল্লা বিমা শা-আ। ওয়াসিআ কুরসিইয়্যুহুস সামাওয়াতি ওয়াল আরদ্, ওয়ালা ইয়াউদুহূ হিফযুহুমা ওয়া হুওয়াল আলিয়্যুল আযীম।",
          "arabic":
              "اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ ۚ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ ۚ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلَّا بِإِذْنِهِ ۚ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ۖ وَلَا يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلَّا بِمَا شَاءَ ۚ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ ۖ وَلَا يَئُودُهُ حِفْظُهُمَا ۚ وَهُوَ الْعَلِيُّ الْعَظِيمُ",
          "meaning":
              "আল্লাহ ছাড়া অন্য কোনো উপাস্য নেই, তিনি চিরঞ্জীব, সবকিছুর ধারক। তাঁকে তন্দ্রা ও নিদ্রা স্পর্শ করে না। আকাশ ও পৃথিবীতে যা কিছু আছে, সবই তাঁর। কে আছে এমন, যে তাঁর অনুমতি ছাড়া তাঁর কাছে সুপারিশ করবে? তাদের সামনে ও পেছনে যা কিছু আছে সবই তিনি জানেন। তাঁর জ্ঞানরাশি থেকে তারা কিছুই আয়ত্ত করতে পারে না, কেবল যতটুকু তিনি চান তা ছাড়া। তাঁর কুরসী (সিংহাসন/ক্ষমতা) আকাশ ও পৃথিবীময় পরিব্যাপ্ত। আর এ দুটির রক্ষণাবেক্ষণ তাঁর জন্য মোটেও ক্লান্তিকর নয়। তিনি পরম উচ্চ ও অতি মহান।",
          "Fazilat":
              "রাতে ঘুমানোর আগে এটি পাঠ করলে আল্লাহর পক্ষ থেকে একজন রক্ষক (ফেরেশতা) নিযুক্ত করা হয় এবং সকাল পর্যন্ত শয়তান তার কাছে আসতে পারে না।",
          "ref": "[সহীহ বুখারী]",
          "target": "1"
        }
      ]
    },
    {
      "packageName": "ইসমে আযম",
      "description":
          "হাদিস অনুযায়ী, এই দোয়া পড়ে আল্লাহর কাছে কিছু চাইলে তিনি তা কবুল করেন এবং বিপদে পড়লে ডাকলে তিনি সাড়া দেন।",
      "dhikrs": [
        {
          "title":
              "আল্লাহুম্মা ইন্নি আসআলুকা বি-আন্না লাকাল হামদু লা-ইলাহা ইল্লা আনতাল মান্নানু বাদিউস সামা-ওয়াতি ওয়াল আরদ্বি, ইয়া যাল জালালি ওয়াল ইকরাম, ইয়া হাইয়্যু ইয়া কাইয়্যুম।",
          "arabic":
              "اللَّهُمَّ إِنِّي أَسْأَلُكَ بِأَنَّ لَكَ الْحَمْدُ لَا إِلَهَ إِلَّا أَنْتَ الْمَنَّانُ بَدِيعُ السَّمَوَاتِ وَالْأَرْضِ يَا ذَا الْجَلَالِ وَالْإِكْرَامِ يَا حَيُّ يَا قَيُّومُ",
          "meaning":
              "সে আল্লাহর সেই 'ইসমে আযম' (মহান নাম) দিয়ে প্রার্থনা করেছে, যার মাধ্যমে ডাকলে তিনি সাড়া দেন এবং যা দিয়ে চাইলে তিনি দান করেন। হে আল্লাহ! আমি আপনার কাছে এই বলে প্রার্থনা করছি যে, সকল প্রশংসা আপনারই। আপনি ছাড়া কোনো ইলাহ (উপাস্য) নেই। আপনি মহাদাতা, আপনি আসমানসমূহ ও পৃথিবীর উদ্ভাবক (সৃষ্টিকর্তা)। হে মহত্ত্ব ও সম্মানের মালিক! হে চিরঞ্জীব! হে সর্বকর্তৃত্বময় অভিভাবক!",
          "Fazilat":
              "বিপদ-আপদে: যেকোনো কঠিন মুসিবতে আল্লাহর সাহায্য পেতে এটি কার্যকর। দোয়া কবুলের জন্য নিজের বিশেষ কোনো প্রয়োজন বা আশা পূরণের আগে এই দোয়ার মাধ্যমে আল্লাহর প্রশংসা করে তারপর নিজের মনের কথা বলুন।:",
          "ref": "[সুনানে আবু দাউদ, হাদিস নং-১৪৯৫]",
          "target": "3"
        },
        {
          "title":
              "আল্লাহুম্মা ইন্নী আসআলুকা বিআন্নী আশহাদু আন্নাকা আন্তাল্লাহু, লা ইলাহা ইল্লা আন্তাল আহাদুস সামাদ, আল্লাযী লাম ইয়ালিদ ওয়া লাম ইউলাদ, ওয়া লাম ইয়াকুল্লাহু কুফুওয়ান আহাদ।",
          "arabic":
              "اللَّهُمَّ إِنِّي أَسْأَلُكَ بِأَنِّي أَشْهَدُ أَنَّكَ أَنْتَ اللَّهُ لَا إِلَهَ إِلَّا أَنْتَ الأَحَدُ الصَّمَدُ الَّذِي لَمْ يَلِدْ وَلَمْ يُولَدْ وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ",
          "meaning":
              "হে আল্লাহ! আমি আপনার কাছে প্রার্থনা করছি এই উসিলায় যে— আমি সাক্ষ্য দিচ্ছি আপনিই আল্লাহ, আপনি ছাড়া কোনো উপাস্য নেই। আপনি এক ও অমুখাপেক্ষী। যিনি কাউকে জন্ম দেননি এবং যাঁকেও জন্ম দেওয়া হয়নি। আর তাঁর সমতুল্য কেউই নেই।",
          "Fazilat":
              "দোয়া কবুলের নিশ্চয়ত নবীজি (সা.) এক ব্যক্তিকে এই দোয়াটি পড়তে শুনে বললেন, সে আল্লাহকে তাঁর এমন এক মহান নামে (ইসমে আযম) ডেকেছে, যা দিয়ে ডাকলে তিসাড়া দে এবং যা দিয়ে চাইলে তিনিদান করেন।",
          "ref": "[সুনানে আবু দাউদ ও তিরমিজি]",
          "target": "3"
        }
      ]
    },
    {
      "packageName": "আইয়ুব (আঃ) এর দোয়া",
      "description": "",
      "dhikrs": [
        {
          "title": "রব্বি আন্নি মাসসানিয়াদ দুররু ওয়া আনতা আরহামুর-রাহিমীন।",
          "arabic":
              "رَبِّ أَنِّي مَسَّنِيَ الضُّرُّ وَأَنْتَ أَرْحَمُ الرَّاحِمِينَ",
          "meaning":
              "হে আমার প্রভু! আমি দুঃখ-কষ্টে (রোগ-ব্যধিতে) পতিত হয়েছি, আর তুমিই তো দয়ালুদের মধ্যে শ্রেষ্ঠ দয়ালু।",
          "Fazilat":
              "শারীরিক অসুস্থতা ছাড়াও যেকোনো মানসিক কষ্ট বা কঠিন বিপদের সময় এই দোয়া পড়লে মন শান্ত হয় এবং আল্লাহর রহমত অবতীর্ণ হয়।",
          "ref": "সুরা আম্বিয়া: ৮৩",
          "target": "10"
        }
      ]
    },
    {
      "packageName": "ইউসুফ (আঃ) এর দোয়া",
      "description": "",
      "dhikrs": [
        {
          "title":
              "আনতা ওয়ালিইয়্যী ফিদ দুনিয়া ওয়াল আখিরাতি, তাওয়াফ্ফানী মুসলিমাঁও ওয়া আলহিক্বনী বিস-সলিহীন।",
          "arabic":
              "أَنتَ وَلِيِّي فِي الدُّنْيَا وَالْآخِرَةِ ۖ تَوَفَّنِي مُسْلِمًا وَأَلْحِقْنِي بِالصَّالِحِينَ",
          "meaning":
              "দুনিয়া ও আখিরাতে আপনিই আমার অভিভাবক। আমাকে মুসলিম অবস্থায় মৃত্যু দিন এবং নেককারদের সাথে আমাকে যুক্ত করুন।",
          "Fazilat":
              "এই দোয়ার প্রধান আবেদন হলো 'মুসলিম অবস্থায় মৃত্যু'। পরকালের সফলতার জন্য এটিই সবচেয়ে বড় পাওয়া। দুনিয়া ও আখিরাতের সব কাজ এবং দুশ্চিন্তার ভার আল্লাহর ওপর ছেড়ে দেওয়ার এক পরম অনুভূতি এই দোয়ায় মিশে আছে।",
          "ref": "[সুরা ইউসুফ: ১০১]",
          "target": "10"
        }
      ]
    },
    {
      "packageName": "হযরত শুয়াইব (আ.)-এর দোয়া",
      "description": "",
      "dhikrs": [
        {
          "title":
              "রাব্বানাফতাহ বাইনানা ওয়া বাইনা ক্বাওমিনা বিল হাক্বি ওয়া আন্তা খাইরুল ফাতিহীন।",
          "arabic":
              "رَبَّنَا افْتَحْ بَيْنَنَا وَبَيْنَ قَوْمِنَا بِالْحَقِّ وَأَنْتَ خَيْرُ الْفَاتِحِينَ",
          "meaning":
              "হে আমাদের পালনকর্তা! আমাদের ও আমাদের সম্প্রদায়ের মধ্যে যথাযথ ফয়সালা করে দিন; আর আপনিই শ্রেষ্ঠ ফয়সালাকারী।",
          "Fazilat":
              "হযরত শুয়াইব (আ.) যখন তাঁর জাতিকে সঠিক পথে আসার দাওয়াত দিচ্ছিলেন, তখন তারা তাঁকে দেশত্যাগের হুমকি দেয়। সেই কঠিন মুহূর্তে তিনি কোনো তর্কে না গিয়ে সরাসরি আল্লাহর কাছে ন্যায়বিচারের প্রার্থনা করেন।",
          "ref": "Unknown",
          "target": "1"
        }
      ]
    },
    {
      "packageName": "ইব্রাহিম (আঃ) এর দোয়া",
      "description": "",
      "dhikrs": [
        {
          "title":
              "রব্বিজ-‘আলনী মুক্বীমাস সলাতি ওয়া মিন যুররিয়্যাতী, রব্বানা ওয়া তাক্বব্বাল দু’আ।",
          "arabic":
              "رَبِّ اجْعَلْنِي مُقِيمَ الصَّلَاةِ وَمِن ذُرِّيَّتِي ۚ رَبَّنَا وَتَقَبَّلْ دُعَاءِ",
          "meaning":
              "হে আমার পালনকর্তা! আমাকে সালাত কায়েমকারী করুন এবং আমার বংশধরদের মধ্য থেকেও। হে আমাদের পালনকর্তা! আমার প্রার্থনা কবুল করুন।",
          "Fazilat":
              "বর্তমানে সন্তানদের দ্বীনের পথে রাখা অনেক চ্যালেঞ্জিং। ইব্রাহিম (আঃ) তাঁর সন্তানদের জন্য এই দোয়া করেছিলেন। এটি পাঠ করলে নিজের সন্তানদের নামাজের প্রতি অনুরাগী হতে আল্লাহ সাহায্য করেন।",
          "ref": "[সুরা ইব্রাহিম: ৪০]",
          "target": "10"
        }
      ]
    },
    {
      "packageName": "দোয়া ইউনুস",
      "description": "",
      "dhikrs": [
        {
          "title":
              "লা ইলাহা ইল্লা আনতা সুবহানাকা ইন্নি কুনতু মিনাজ জোয়ালিমিন।",
          "arabic":
              "لَّا إِلَٰهَ إِلَّا أَنتَ سُبْحَانَكَ إِنِّي كُنتُ مِنَ الظَّالِمِينَ",
          "meaning":
              "(হে আল্লাহ!) আপনি ব্যতীত আর কোনো উপাস্য নেই। আমি আপনার পবিত্রতা ঘোষণা করছি। অবশ্যই আমি পাপিষ্ঠদের অন্তর্ভুক্ত হয়ে গেছি (আমি নিজের উপর জুলুম করেছি)।",
          "Fazilat":
              "হজরত ইউনুস (আঃ) এই দোয়া পড়েই গভীর সমুদ্রের অন্ধকারের মধ্যে মাছের পেট থেকে মুক্তি পেয়েছিলেন। যেকোনো কঠিন বিপদ বা সংকটে এই দোয়া পড়লে আল্লাহ তায়ালা সাহায্য করেন। রাসুলুল্লাহ (সা.) বলেছেন, \"কোনো মুসলিম যদি কোনো বিষয়ে এই দোয়ার মাধ্যমে আল্লাহর নিকট প্রার্থনা করে, আল্লাহ অবশ্যই তা কবুল করেন।",
          "ref": "তিরমিজি: ৩৫০৫",
          "target": "10"
        }
      ]
    },
    {
      "packageName": "মুসা (আঃ) এর দোয়া (সুরা ত্ব-হা: ২৫-২৮)",
      "description": "",
      "dhikrs": [
        {
          "title":
              "রব্বিশরাহলী সদরী, ওয়া ইয়াসসিরলী আমরী, ওয়াহলুল ‘উকদাতাম মিল লিসানী, ইয়াফকাহূ ক্বওলী।",
          "arabic":
              "رَبِّ اشْرَحْ لِي صَدْرِي * وَيَسِّرْ لِي أَمْرِي * وَاحْلُلْ عُقْدَةً مِّن لِّسَانِي * يَفْقَهُوا قَوْلِي",
          "meaning":
              "হে আমার পালনকর্তা! আমার বক্ষ প্রশস্ত করে দিন। এবং আমার কাজকে সহজ করে দিন। এবং আমার জিহ্বা থেকে জড়তা দূর করে দিন, যাতে তারা আমার কথা বুঝতে পারে।",
          "Fazilat":
              "কথা বলার জড়তা দূর করা যাদের কথা বলতে সমস্যা হয় বা মানুষের সামনে কথা বলতে ভয় পান (Public Speaking Anxiety), তাদের জন্য এটি মহৌষধ। এটি পাঠ করলে কথা বলার সাহস এবং সাবলীলতা বৃদ্ধি পায়, যেকোনো কঠিন দায়িত্ব বা কাজ শুরু করার আগে এই দোয়াটি পড়লে আল্লাহর রহমতে সেই কাজ অনেক সহজ হয়ে যায়।",
          "ref": "সুরা ত্ব-হা: ২৫-২৮",
          "target": "10"
        }
      ]
    },
    {
      "packageName": "ওযুর পরের আমল ও কালেমা শাহাদাত",
      "description":
          "ওযুর পর এই সাক্ষ্য দেওয়ার মাধ্যমে বান্দার তাওহীদ ও রিসালাতের প্রতি ঈমান দৃঢ় হয়।",
      "dhikrs": [
        {
          "title":
              "আশহাদু আল্লা ইলাহা ইল্লাল্লাহু ওয়াহদাহু লা শারীকা লাহূ, ওয়া আশহাদু আন্না মুহাম্মাদান আবদুহূ ওয়া রাসূলুহূ।",
          "arabic":
              "أَشْهَدُ أَنْ لَا إِلٰهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ",
          "meaning":
              "আমি সাক্ষ্য দিচ্ছি যে, আল্লাহ ব্যতীত কোনো উপাস্য নেই। তিনি একক, তাঁর কোনো অংশীদার নেই। আমি আরও সাক্ষ্য দিচ্ছি যে, নিশ্চয়ই মুহাম্মাদ (সা.) তাঁর বান্দা ও রাসূল।",
          "Fazilat":
              "রাসুলুল্লাহ (সা.) বলেছেন, যে ব্যক্তি পূর্ণাঙ্গভাবে ওযু করে এই দোয়াটি পড়বে, তার জন্জান্নাতের আটটি দরজাই খুলে দেওয়া হব। সে যে কোনো দরজা দিয়ে ইচ্ছা জান্নাতে প্রবেশ করতে পারব।",
          "ref": "[সহিহ মুসলিম, হাদিস নং: ২৩৪]",
          "target": "1"
        },
        {
          "title":
              "আল্লাহুম্মাজ-'আলনী মিনাত তাওয়াবীন, ওয়াজ-'আলনী মিনাল মুতাতহহিরীন",
          "arabic":
              "اللَّهُمَّ اجْعَلْنِي مِنَ التَّوَّابِينَ وَاجْعَلْنِي مِنَ الْمُتَطَهِّرِينَ",
          "meaning":
              "হে আল্লাহ! আমাকে তওবাকারী এবং পবিত্রতা অর্জনকারীদের অন্তর্ভুক্ত করুন।",
          "Fazilat": "",
          "ref": "Unknown",
          "target": "1"
        }
      ]
    },
    {
      "packageName": "চার বিপদ থেকে মুক্তির দোয়া",
      "description":
          "এই দোয়ায় মুমিনের জীবনের সবচেয়ে বড় ৪টি ভয়ের বিষয় (পরকাল, কবর, দুনিয়াবী পরীক্ষা ও দাজ্জাল) থেকে আল্লাহর কাছে আশ্রয় চাওয়া হয়।",
      "dhikrs": [
        {
          "title":
              "আল্লাহুম্মা ইন্নী আঊযুবিকা মিন আযাবি জাহান্নাম, ওয়া মিন আযাবিল ক্ববর, ওয়া মিন ফিতনাতিল মাহ্ইয়া ওয়াল মামাত, ওয়া মিন শাররি ফিতনাতিল মাসীহিদ্ দাজ্জাল।",
          "arabic":
              "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ جَهَنَّمَ، وَمِنْ عَذَابِ الْقَبْرِ، وَمِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ، وَمِنْ شَرِّ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ",
          "meaning":
              "হে আল্লাহ! আমি আপনার কাছে আশ্রয় চাচ্ছি জাহান্নামের আজাব থেকে, কববরের আজাব থেকে, জীবন ও মৃত্যুর ফিতনা (পরীক্ষা) থেকে এবং মসীহ দাজ্জালের অনিষ্ট ও ফিতনা থেকে।",
          "Fazilat":
              "শেষ জামানায় দাজ্জালের ফিতনা হবে সবচেয়ে ভয়াবহ। নিয়মিত এই দোয়া পাঠ করলে দাজ্জালের ফিতনা থেকে নিরাপদ থাকা যায়।",
          "ref": "Unknown",
          "target": "1"
        }
      ]
    },
    {
      "packageName": "দুনিয়া ও আখিরাতের কল্যাণের দোয়া",
      "description":
          "পবিত্র কুরআনের সবচেয়ে ব্যাপক এবং জনপ্রিয় একটি দোয়া, যা সূরা বাকারার ২০১ নম্বর আয়াত। এই একটি দোয়ার মধ্যে দুনিয়া ও আখিরাতের সমস্ত কল্যাণ চাওয়া হয়েছে।",
      "dhikrs": [
        {
          "title":
              "রাব্বানা আতিনা ফিদ্দুনিয়া হাসানাতাও ওয়া ফিল আখিরাতি হাসানাতাও ওয়াক্বিনা আযাবান নার।",
          "arabic":
              "رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ",
          "meaning":
              "হে আমাদের প্রতিপালক! আমাদের দুনিয়াতে কল্যাণ দান করুন এবং পরকালেও কল্যাণ দান করুন এবং আমাদের আগুনের (জাহান্নামের) আজাব থেকে রক্ষা করুন।",
          "Fazilat":
              "হযরত আনাস (রা.) বর্ণনা করেছেন যে, নবীজি (সা.) অধিকাংশ সময় এই দোয়াটি পাঠ করতেন।",
          "ref": "[সহীহ বুখারী ও মুসলিম]",
          "target": "3"
        }
      ]
    },
    {
      "packageName": "দুশ্চিন্তা ও বিপদ মুক্তির দোয়া",
      "description":
          "বিপদের সময় নবীজি (সা.)-এর আমল: হযরত আনাস (রা.) থেকে বর্ণিত, যখন রাসূলুল্লাহ (সা.) কোনো কঠিন সমস্যায় বা দুশ্চিন্তায় পড়তেন, তখন তিনি এই দোয়াটি পাঠ করতেন।",
      "dhikrs": [
        {
          "title": "ইয়া হাইয়্যু ইয়া ক্বাইয়্যূমু বিরাহমাতিকা আস্তাগীস।",
          "arabic": "يَا حَيُّ يَا قَيُّومُ بِرَحْمَتِكَ أَسْتَغِيثُ",
          "meaning":
              "হে চিরঞ্জীব! হে মহাবিশ্বের ধারক! আপনার রহমতের উসিলায় আমি সাহায্য প্রার্থনা করছি।",
          "Fazilat":
              "সকাল-সন্ধ্যার আমল: নবীজি (সা.) তাঁর মেয়ে ফাতেমা (রা.)-কে উপদেশ দিয়েছিলেন যেন তিনি সকাল এবং সন্ধ্যায় এই দোয়াটি পাঠ করেন।",
          "ref": "[তিরমিযী]",
          "target": "33"
        },
        {
          "title": "লা ইলাহা ইল্লা আনতা সুবহানাকা ইন্নী কুনতু মিনায যালিমীন।",
          "arabic":
              "لَا إِلَٰهَ إِلَّا أَنْتَ سُبْحَانَكَ إِنِّي كُنْتُ مِنَ الظَّالِمِينَ",
          "meaning":
              "আপনি ছাড়া কোনো উপাস্য নেই, আপনি পবিত্র-মহান। নিশ্চয়ই আমি পাপিষ্ঠদের (অপরাধীদের) অন্তর্ভুক্ত হয়ে গেছি।",
          "Fazilat":
              "রাসুলুল্লাহ (সা.) বলেছেন, কোনো মুসলিম যদি কোনো বিপদে পড়ে এই দোয়া পাঠ করে, তবে আল্লাহ অবশ্যই তার দোয়া কবুল করবেন। কঠিন দুশ্চিন্তা বা মন খারাপের সময় এই দোয়াটি পাঠ করলে মনের মেঘ কেটে যায় এবং আল্লাহর রহমত অনুভূত হয়।",
          "ref": "[তিরমিজি: ৩৫০৫]",
          "target": "100"
        },
        {
          "title": "আউযু বিকালিমা-তিল্লাহিত তা-ম্মাতি মিন শাররি মা খালাক্ব।",
          "arabic":
              "أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ",
          "meaning":
              "আল্লাহর পরিপূর্ণ কালামসমূহের উসিলায় আমি তাঁর সৃষ্টিজগতের সমস্ত অনিষ্ট থেকে আশ্রয় চাচ্ছি।",
          "Fazilat":
              "রাসূলুল্লাহ (সা.) বলেছেন, যে ব্যক্তি কোনো মনজিলে (থাকার জায়গায়) অবতরণ করে এই দোয়াটি পাঠ করবে, ওই জায়গা থেকে বিদায় না হওয়া পর্যন্ত কোনো কিছুই তার ক্ষতি করতে পারবে না।",
          "ref": "[সহীহ মুসলিম: ২৭০৮]",
          "target": "1"
        }
      ]
    },
    {
      "packageName": "দৈনন্দিন দোয়া",
      "description": "ঈমান অটল রাখার জন্য অত্যন্ত গুরুত্বপূর্ণ একটি দোয়া।",
      "dhikrs": [
        {
          "title":
              "ঘুম, খাবার ও ভ্রমণের দোয়া:\nবি-ইসমিকা আল্লাহুম্মা আমূতু ওয়া আহ্ইয়া।",
          "arabic": "بِاسْمِكَ اللَّهُمَّ أَمُوتُ وَأَحْيَا",
          "meaning":
              "হে আল্লাহ! আপনার নাম নিয়েই আমি মৃত্যুবরণ (ঘুম) করি এবং জীবিত (জাগ্রত) হই।",
          "Fazilat":
              "রাসুলুল্লাহ (সা.) প্রতি রাতে ঘুমানোর সময় ডান গালের নিচে হাত রেখে এই দোয়াটি পাঠ করতেনঘুমানোর সময় মানুষ এক প্রকার 'অর্ধ-মৃত' অবস্থায় থাকে। এই দোয়া পাঠ করার মাধ্যমে বান্দা নিজেকে আল্লাহর জিম্মায় সপে দেয়।",
          "ref": "[বুখারী]",
          "target": "1"
        },
        {
          "title":
              "ঘর থেকে বের হওয়ার দোয়া:\nবিসমিল্লাহি তাওয়াক্কালতু আলাল্লাহি, লা হাওলা ওয়ালা কুওয়াতা ইল্লা বিল্লাহ।",
          "arabic":
              "بِسْمِ اللَّهِ تَوَكَّلْتُ عَلَى اللَّهِ لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ",
          "meaning":
              "আল্লাহর নামে (বের হচ্ছি), আল্লাহর ওপরই ভরসা করলাম। আল্লাহর সাহায্য ছাড়া (গুনাহ থেকে বাঁচার) কোনো পথ নেই এবং (নেক কাজ করার) কোনো শক্তি নেই।",
          "Fazilat":
              "এই দোয়া পড়লে শয়তান তার সঙ্গীকে বলে, যে ব্যক্তিকে হেদায়েত দেওয়া হয়েছে, যার জন্য আল্লাহ যথেষ্ট এবং যাকে রক্ষা করা হয়েছে তার ওপর আমরা কীভাবে প্রভাব খাটাতে পারি? ফলে শয়তান তার থেকে দূরে সরে যায়।",
          "ref": "[আবু দাউদ ও তিরমিজি]",
          "target": "1"
        },
        {
          "title": "ইয়া মুক্বাল্লিবাল কুলুব, সাব্বিত ক্বালবী 'আলা দ্বীনিকা।",
          "arabic": "يَا مُقَلِّبَ الْقُلُوبِ ثَبِّتْ قَلْبِي عَلَى دِينِكَ",
          "meaning":
              "হে অন্তরসমূহের পরিবর্তনকারী! আমার অন্তরকে আপনার দ্বীনের ওপর অটল রাখুন।",
          "Fazilat":
              "নবীজি (সা.) ব্যাখ্যা করেছেন যে, মানুষের অন্তর আল্লাহর দুটি আঙুলের মাঝে থাকে, তিনি যেভাবে চান সেভাবেই তা পরিবর্তন করেন। তাই ঈমানের ওপর টিকে থাকতে এই দোয়াটি অপরিহার্য ফিতনার সময় সুরক্ষা শেষ জামানায় যখন মানুষের ঈমান রাখা কঠিন হয়ে পড়বে, তখন এই দোয়াটি অন্তরের দৃঢ়তা বজায় রাখতে সাহায্য করে",
          "ref": "[তিরমিযী: ৩৫২২]",
          "target": "33"
        },
        {
          "title":
              "ঘুম থেকে ওঠার পর পড়ার বিশেষ দোয়া:\nআলহামদু লিল্লাহিল্লাজী আহইয়ানা বা’দা মা আমাতানা ওয়া ইলাইহিন নুশুর।",
          "arabic":
              "الْحَمْدُ لِلَّهِ الَّذِي أَحْيَانَا بَعْدَ مَا أَمَاتَنَا وَإِلَيْهِ النُّشُورُ",
          "meaning":
              "সমস্ত প্রশংসা সেই আল্লাহর জন্য, যিনি আমাদের মৃত্যুর (ঘুমের) পর পুনরায় জীবিত করলেন এবং তাঁরই দিকে আমাদের ফিরে যেতে হবে।",
          "Fazilat":
              "ইসলামে ঘুমকে অর্ধ-মৃত্যু বলা হয়। তাই নতুন একটি দিন পাওয়া মানে আল্লাহ আমাদের আরও একবার ইবাদত করার সুযোগ দিলেন। এই দোয়ার মাধ্যমে সেই নেয়ামতের কৃতজ্ঞতা প্রকাশ করা হয়।",
          "ref": "[সহীহ বুখারী ও মুসলিম]",
          "target": "1"
        },
        {
          "title":
              "রাতে ঘুম ভাঙলেঃ\nলা ইলাহা ইল্লাল্লাহু ওয়াহদাহু লা শারীকা লাহু, লাহুল মুলকু ওয়া লাহুল হামদু ওয়া হুয়া 'আলা কুল্লি শায়ইন্ ক্বাদীর। সুবহানাল্লাহি ওয়ালহামদু লিল্লাহি ওয়া লা ইলাহা ইল্লাল্লাহু ওয়াল্লাহু আকবার। ওয়া লা হাওলা ওয়ালা কুওয়াতা ইল্লা বিল্লাহিল 'আলিয়্যিল 'আযীম। রাব্বিগফির লী।",
          "arabic":
              "لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، سُبْحَانَ اللَّهِ، وَالْحَمْدُ لِلَّهِ، وَلَا إِلَهَ إِلَّا اللَّهُ، وَاللَّهُ أَكْبَرُ، وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ الْعَلِيِّ الْعَظِيمِ، رَبِّ اغْفِرْ لِي",
          "meaning":
              "আল্লাহ ছাড়া আর কোনো হক্ব ইলাহ নেই। তাঁর কোনো শরীক নেই। রাজত্ব তাঁরই, প্রশংসাও তাঁরই; আর তিনি সকল কিছুর ওপর ক্ষমতাবান। আল্লাহ পবিত্র, মহান! সকল প্রশংসা আল্লাহর। আল্লাহ ছাড়া কোনো ইলাহ নেই। আল্লাহ সবচেয়ে বড়, সুউচ্চ সুমহান। আল্লাহর সাহায্য ছাড়া (পাপ কাজ থেকে দূরে থাকার) কোনো উপায় এবং (সৎকাজ করার) কোনো শক্তি কারো নেই। হে রব, আমাকে ক্ষমা করুন!",
          "Fazilat":
              "গুনাহ মাফ: দোয়াটি পাঠ করলে পাঠকারীর গুনাহ ক্ষমা করে দেওয়া হয়। দোয়া কবুল: এটি পড়ার পর কোনো দোয়া করলে তা কবুল করা হয়।",
          "ref": "[সহীহ বুখারী ৩/৩৯, হাদিস নং ১১৪৫; সহীহ ইবনে মাজাহ ২/৩৩৫]",
          "target": "1"
        },
        {
          "title":
              "আল্লাহুম্মা ইন্নী আসআলুকা ইলমান নাফিয়াঁও, ওয়া রিযকান তায়্যিবান, ওয়া আমালান মুতাক্বাব্বালান।",
          "arabic":
              "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْمًا نَافِعًا، وَرِزْقًا طَيِّبًا، وَعَمَلًا مُتَقَبَّلًا",
          "meaning":
              "হে আল্লাহ! আমি আপনার কাছে উপকারী জ্ঞান, পবিত্র (হালাল) রিযিক এবং কবুলযোগ্য আমল প্রার্থনা করছি।",
          "Fazilat":
              "উম্মে সালামাহ (রা.) থেকে বর্ণিত, নবীজি (সা.) ফজরের সালাতে সালাম ফেরানোর পর নিয়মিত এই দোয়াটি পড়তেন।",
          "ref": "[সুনানে ইবনে মাজাহ: ৯২৫]",
          "target": "10"
        },
        {
          "title":
              "আল্লাহুম্মা ইন্নী আউযু বিকা মিন আযাবিল ক্বাবরি, ওয়া আউযু বিকা মিন ফিতনাতিল মাসীহিদ দাজ্জাল, ওয়া আউযু বিকা মিন ফিতনাতিল মাহইয়া ওয়াল মামাত, আল্লাহুম্মা ইন্নী আউযু বিকা মিনাল মা'ছামি ওয়াল মাগরাম।",
          "arabic":
              "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ، وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ، اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْمَأْثَمِ وَالْمَغْرَمِ",
          "meaning":
              "হে আল্লাহ! আমি আপনার কাছে কবরের আজাব থেকে আশ্রয় চাই, আপনার কাছে আশ্রয় চাই মসীহ দাজ্জালের ফিতনা থেকে, আপনার কাছে আশ্রয় চাই জীবন ও মৃত্যুর ফিতনা থেকে। হে আল্লাহ! আমি আপনার কাছে আশ্রয় চাই গুনাহ এবং ঋণ (ধার-দেনা) থেকে।",
          "Fazilat":
              "এই দোয়ার একটি বিশেষ অংশ হলো 'মাগরাম' (ঋণ) থেকে মুক্তি চাওয়া। এক সাহাবী যখন জিজ্ঞেস করলেন, \"হে আল্লাহর রাসুল! আপনি ঋণ থেকে এত বেশি আশ্রয় চান কেন?\" তিনি উত্তর দিলেন, \"মানুষ যখন ঋণগ্রস্ত হয়, তখন সে কথা বলতে গিয়ে মিথ্যা বলে এবং ওয়াদা করলে তা ভঙ্গ করে।",
          "ref": "[সহীহ বুখারী: ৮৩৩]",
          "target": "1"
        },
        {
          "title":
              "আল্লাহুম্মা ইন্নী আউযু বিকা মিন আযাবি জাহান্নাম, ওয়া মিন আযাবিল ক্বাবরি, ওয়া মিন ফিতনাতিল মাহ্ইয়া ওয়াল মামাতি, ওয়া মিন শাররি ফিতনাতিল মাসীহিদ দাজ্জাল।",
          "arabic":
              "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ جَهَنَّمَ، وَمِنْ عَذَابِ الْقَبْرِ، وَمِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ، وَمِنْ شَرِّ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ",
          "meaning":
              "হে আল্লাহ! আমি আপনার কাছে আশ্রয় চাই জাহান্নামের আজাব থেকে, কবরের আজাব থেকে, জীবন ও মৃত্যুর ফিতনা (পরীক্ষা) থেকে এবং মসীহ দাজ্জালের অনিষ্ট ও ফিতনা থেকে।",
          "Fazilat":
              "আবু হুরায়রা (রা.) থেকে বর্ণিত, রাসুলুল্লাহ (সা.) বলেছেন- তোমাদের কেউ যখন নামাজের শেষ তাশাহহুদ শেষ করবে, তখন সে যেন এই চারটি বিষয় থেকে আল্লাহর কাছে আশ্রয় চায়।",
          "ref": "[সহীহ মুসলিম: ৫৮৮]",
          "target": "1"
        },
        {
          "title":
              "আল্লাহুম্মা ইন্নী আউযু বিকা মিনাল বুখলি, ওয়া আউযু বিকা মিনাল জুবনি, ওয়া আউযু বিকা আন উরাদ্দা ইলা আরযালিল উমুরি, ওয়া আউযু বিকা মিন ফিতনাতিদ দুনইয়া ওয়া আযাবিল ক্বাবরি।",
          "arabic":
              "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْبُخْلِ، وَأَعُوذُ بِكَ مِنَ الْجُبْنِ، وَأَعُوذُ بِكَ أَنْ أُرَدَّ إِلَى أَرْذَلِ الْعُمُرِ، وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الدُّنْيَا، وَأَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ",
          "meaning":
              "হে আল্লাহ! আমি আপনার কাছে কৃপণতা থেকে আশ্রয় চাই, আপনার কাছে আশ্রয় চাই ভীরুতা (ভয়) থেকে, আপনার কাছে আশ্রয় চাই বার্ধক্যের নিকৃষ্ট অবস্থা (পরনির্ভরশীলতা) থেকে। আর আপনার কাছে আশ্রয় চাই দুনিয়ার ফিতনা এবং কবরের আজাব থেকে।",
          "Fazilat":
              "বৃদ্ধ বয়সে অন্যের ওপর বোঝা হয়ে থাকা বা স্মৃতিশক্তি ও বিবেকবুদ্ধি হারিয়ে ফেলা (আরযালিল উমুর) থেকে মুক্তির জন্য এটি সর্বোত্তম দোয়া।",
          "ref": "Unknown",
          "target": "1"
        },
        {
          "title":
              "আলাল্লাহি তাওয়াক্কালনা; রাব্বানফতাহ্ বাইনানা ওয়া বাইনা ক্বাওমিনা বিল হাক্বি ওয়া আন্তা খাইরুল ফাতিহীন।",
          "arabic":
              "عَلَى اللَّهِ تَوَكَّلْنَا ۚ رَبَّنَا افْتَحْ بَيْنَنَا وَبَيْنَ قَوْمِنَا بِالْحَقِّ وَأَنْتَ خَيْرُ الْفَاتِحِينَ",
          "meaning":
              "আমরা আল্লাহর ওপরই ভরসা করলাম। হে আমাদের প্রতিপালক! আমাদের ও আমাদের সম্প্রদায়ের মধ্যে ইনসাফের সাথে ফয়সালা করে দিন; আর আপনিই শ্রেষ্ঠ ফয়সালাকারী",
          "Fazilat":
              "যখন আপনি জানেন যে আপনি সত্যের পথে আছেন কিন্তু চারপাশের মানুষ বা পরিস্থিতি আপনার বিপক্ষে, তখন এই দোয়াটি আল্লাহর পক্ষ থেকে সাহায্য ও কুদরতি ফয়সালা নিয়ে আসে।",
          "ref": "[সূরা আল-আ’রাফ - আয়াত ৮৯]",
          "target": "1"
        },
        {
          "title":
              "রাব্বানা যলামনা আনফুসানা, ওয়া ইল্লাম তাগফির লানা ওয়া তারহামনা লানাকূনান্না মিনাল খাসিরীন।",
          "arabic":
              "رَبَّنَا ظَلَمْنَا أَنْفُسَنَا وَإِنْ لَمْ تَغْفِرْ لَنَا وَتَرْحَمْنَا لَنَكُونَنَّ مِنَ الْخَاسِرِينَ",
          "meaning":
              "হে আমাদের প্রতিপালক! আমরা নিজেদের ওপর জুলুম (অবিচার) করেছি। আপনি যদি আমাদের ক্ষমা না করেন এবং আমাদের ওপর দয়া না করেন, তবে অবশ্যই আমরা ক্ষতিগ্রস্তদের অন্তর্ভুক্ত হয়ে যাবো।",
          "Fazilat":
              "এই দোয়ায় নিজের ভুল স্বীকার করার মাধ্যমে আল্লাহর অসীম দয়া ও ক্ষমার ওপর পূর্ণ নির্ভরতা প্রকাশ পায়।",
          "ref": "[সূরা আল-আ’রাফ-এর ২৩]",
          "target": "1"
        }
      ]
    },
    {
      "packageName": "নামাজের জন্য সহজ এবং ছোট দশটি সুরা",
      "description": "",
      "dhikrs": [
        {
          "title":
              "সুরা আল-ফাতিহাঃ \nবিসমিল্লাহির রাহমানির রাহিম। \nআলহামদু লিল্লাহি রাব্বিল আলামিন। \nআর-রাহমানির রাহিম। মালিকি ইয়াওমিদ্দিন। \nইয়্যাকা না'বুদু ওয়া ইয়্যাকা নাস্তাঈন। \nইহদিনাস সিরাতাল মুস্তাকিম। \nসিরাতাল্লাজিনা আনআমতা আলাইহিম, গাইরিল মাগদুবি আলাইহিম ওয়ালাদ্দাল্লিন।",
          "arabic":
              " بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ (১)\n الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ (২)\n الرَّحْمَنِ الرَّحِيمِ (৩)\n مَالِكِ يَوْمِ الدِّينِ (৪)\n إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ (৫)\n اهْدِنَا الصِّرَاطَ الْمُسْتَقِيمَ (৬)\n صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ (৭)",
          "meaning":
              "শুরু করছি আল্লাহর নামে যিনি পরম করুণাময় ও অতি দয়ালু। সকল প্রশংসা আল্লাহর জন্য যিনি জগতসমূহের প্রতিপালক। যিনি পরম করুণাময় ও অতি দয়ালু। যিনি বিচার দিবসের মালিক। আমরা একমাত্র আপনারই ইবাদত করি এবং একমাত্র আপনারই সাহায্য চাই। আমাদের সরল পথ দেখান। তাঁদের পথ যাদের আপনি নেয়ামত দিয়েছেন; তাঁদের পথ নয় যারা আপনার ক্রোধের শিকার ও পথভ্রষ্ট।",
          "Fazilat": "",
          "ref": "সুরা আল-ফাতিহা (Surah Al-Fatiha)",
          "target": "1"
        },
        {
          "title":
              "সুরা আল-আসরঃ \n ওয়াল আসরি। \nইন্নাল ইনসানা লাফি খুসরিন। \nইল্লাল্লাজিনা আমানু ওয়া আমিলুস সালিহাতি ওয়া তাওয়াসাও বিল হাক্কি ওয়া তাওয়াসাও বিসসাবর।",
          "arabic":
              "وَالْعَصْرِ (১) \nإِنَّ الْإِنْسَانَ لَفِي خُسْرٍ (২)\nإِلَّا الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ وَتَوَاصَوْا بِالْحَقِّ وَتَوَاصَوْا بِالصَّبْرِ (৩)",
          "meaning":
              "সময়ের কসম, নিশ্চয়ই মানুষ ক্ষতিগ্রস্ত। কিন্তু তারা নয় যারা ঈমান এনেছে, সৎকাজ করেছে এবং পরস্পরকে সত্যের উপদেশ দিয়েছে ও ধৈর্যের উপদেশ দিয়েছে।",
          "Fazilat": "",
          "ref": "সুরা আল-আসর (Surah Al-Asr)",
          "target": "1"
        },
        {
          "title":
              "সুরা আল-কাওসারঃ \nইন্না আ’তাইনা কাল কাওসার। \nফাসাল্লি লি-রাব্বিকা ওয়ানহার। \nইন্না শানিআকা হুয়াল আবতার।",
          "arabic":
              "إِنَّا أَعْطَيْنَاكَ الْكَوْثَرَ (১)\nفَصَلِّ لِرَبِّكَ وَانْحَرْ (২)\nإِنَّ شَانِئَكَ هُوَ الْأَبْتَرُ (৩)",
          "meaning":
              "নিশ্চয়ই আমি আপনাকে কাওসার দান করেছি। অতএব আপনার প্রতিপালকের উদ্দেশ্যে নামাজ পড়ুন ও কোরবানি দিন। নিশ্চয়ই আপনার শত্রুই নির্বংশ।",
          "Fazilat": "",
          "ref": "সুরা আল-কাওসার (Surah Al-Kawthar)",
          "target": "1"
        },
        {
          "title":
              "সুরা আল-ইখলাসঃ \nকুল হুয়াল্লাহু আহাদ। \nআল্লাহু সামাদ। \nলাম ইয়ালিদ ওয়া লাম ইউলাদ। \nওয়া লাম ইয়াকুল্লাহু কুফুওয়ান আহাদ।",
          "arabic":
              "قُلْ هُوَ اللَّهُ أَحَدٌ (১)\nاللَّهُ الصَّمَدُ (২)\nلَمْ يَلِدْ وَلَمْ يُولَدْ (৩)\nوَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ (৪)",
          "meaning":
              "বলুন, তিনি আল্লাহ এক। আল্লাহ অমুখাপেক্ষী। তিনি কাউকে জন্ম দেননি এবং তাঁকেও কেউ জন্ম দেয়নি। এবং তাঁর সমতুল্য কেউ নেই।",
          "Fazilat": "",
          "ref": "সুরা আল-ইখলাস (Surah Al-Ikhlas)",
          "target": "1"
        },
        {
          "title":
              "সুরা আল-ফালাকঃ \nকুল আউজু বিরাব্বিল ফালাক। \nমিন শাররি মা খালাক। \nওয়া মিন শাররি গাসিকিন ইজা ওয়াকাব। \nওয়া মিন শাররিন নাফফাসাতি ফিল উকাদ।\nওয়া মিন শাররি হাসিদিন ইজা হাসাদ।",
          "arabic":
              "قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ (১)\nمِنْ شَرِّ مَا خَلَقَ (২)\nوَمِنْ شَرِّ غَاسِقٍ إِذَا وَقَبَ (৩)\nوَمِنْ شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ (৪)\nوَمِنْ شَرِّ حَاسِدٍ إِذَا حَسَدَ (৫)",
          "meaning":
              "বলুন, আমি আশ্রয় চাই ভোরের প্রতিপালকের। তিনি যা সৃষ্টি করেছেন তার অনিষ্ট থেকে। অন্ধকার রাতের অনিষ্ট থেকে যখন তা ছেয়ে যায়। গিরায় ফুঁ দানকারী নারীদের অনিষ্ট থেকে। এবং হিংসুকের অনিষ্ট থেকে যখন সে হিংসা করে।",
          "Fazilat": "",
          "ref": "সুরা আল-ফালাক (Surah Al-Falaq)",
          "target": "1"
        },
        {
          "title":
              "সুরা আন-নাস \nকুল আউজু বিরাব্বিন নাস। \nমালিকিন নাস। ইলাহিন নাস। \nমিন শাররিল ওয়াসওয়াসিল খান্নাস। \nআল্লাজি ইউওয়াসউিসু ফি সুদূরিন নাস। \nমিনাল জিন্নাতি ওয়ান নাস।",
          "arabic":
              "قُلْ أَعُوذُ بِرَبِّ النَّاسِ (১)\nمَلِكِ النَّاسِ (২)\nإِلَهِ النَّاسِ (৩)\nمِنْ شَرِّ الْوَسْوَاسِ الْخَنَّاسِ (৪)\nالَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ (৫)\nمِنَ الْجِنَّةِ وَالنَّاسِ (৬)",
          "meaning":
              "বলুন, আমি আশ্রয় চাই মানুষের প্রতিপালকের। মানুষের অধিপতির। মানুষের ইলাহ-এর (উপাস্যের)। কুমন্ত্রণাদাতার অনিষ্ট থেকে যে আত্মগোপন করে। যে মানুষের অন্তরে কুমন্ত্রণা দেয়। জিনের মধ্য থেকে অথবা মানুষের মধ্য থেকে।",
          "Fazilat": "",
          "ref": "সুরা আন-নাস (Surah An-Nas)",
          "target": "1"
        },
        {
          "title":
              "সুরা আল-ফীলঃ \nআলাম তারা কাইফা ফাআলা রাব্বুকা বি আস-হাবিল ফীল। \nআলাম ইয়াজআল কাইদাহুম ফি তাদলীল। \nওয়া আরসালা আলাইহিম তাইরান আবাবীল। \nতারমীহিম বি-হিজারাতিম মিন সিজ্জীল। \nফাজাআলাহুম কা আসফিম মাকুল।",
          "arabic":
              "أَلَمْ تَرَ كَيْفَ فَعَلَ رَبُّكَ بِأَصْحَابِ الْفِيلِ (১)\nأَلَمْ يَجْعَلْ كَيْدَهُمْ فِي تَضْلِيلٍ (২)\nوَأَرْسَلَ عَلَيْهِمْ طَيْرًا أَبَابِيلَ (৩)\nتَرْمِيهِمْ بِحِجَارَةٍ مِنْ سِجِّيلٍ (৪)\nفَجَعَلَهُمْ كَعَصْفٍ مَأْكُولٍ (৫)",
          "meaning":
              "আপনি কি দেখেননি আপনার প্রতিপালক হাতিওয়ালাদের সাথে কি করেছিলেন? তিনি কি তাদের চক্রান্ত নস্যাৎ করে দেননি? তিনি তাদের ওপর ঝাঁকে ঝাঁকে পাখি পাঠিয়েছিলেন। যারা তাদের ওপর কঙ্কর নিক্ষেপ করছিল। অতঃপর তিনি তাদের চিবানো ভুসির মতো করে দিলেন।",
          "Fazilat": "",
          "ref": "সুরা আল-ফীল (Surah Al-Fil)",
          "target": "1"
        },
        {
          "title":
              "সুরা কুরাইশঃ \nলি-ঈলাফি কুরাইশ।\nঈলাফিহিম রিহলাতাশ শিতায়ি ওয়াস সাইফ। \nফাল ইয়া’বুদু রাব্বা হাজাল বাইত। \nআল্লাজি আতআ’মাহুম মিন জুয়িন ওয়া আমানাহুম মিন খাওফ।",
          "arabic":
              "لِإِيلافِ قُرَيْشٍ (১)\nإِيلافِهِمْ رِحْلَةَ الشِّتَاءِ وَالصَّيْفِ (২)\nفَلْيَعْبُدُوا رَبَّ هَذَا الْبَيْتِ (৩)\nالَّذِي أَطْعَمَهُمْ مِنْ جُوعٍ وَآمَنَهُمْ مِنْ خَوْفٍ (৪)",
          "meaning":
              "কুরাইশদের আসক্তির জন্য। আসক্তি তাদের শীত ও গ্রীষ্মের সফরের। অতএব তারা এই ঘরের প্রতিপালকের ইবাদত করুক। যিনি তাদের ক্ষুধা থেকে আহার দিয়েছেন এবং ভয় থেকে নিরাপদ করেছেন।",
          "Fazilat": "",
          "ref": "সুরা কুরাইশ (Surah Quraish)",
          "target": "1"
        },
        {
          "title":
              "সুরা আল-মাউনঃ \nআ-রাআইতাল্লাজি ইউকাজ্জিবু বিদ্দীন। \nফাজালিকাল্লাজি ইয়াদুউল ইয়াতীম। \nওয়ালা ইয়াহুদ্দু আলা তাআমিল মিসকিন। \nফাওয়াইলুল লিল মুসাল্লিন। \nআল্লাজিনা হুম আন সালাতিহিম সাহুন। \nআল্লাজিনা হুম ইউরাউন। ওয়া ইয়ামনাউনাল মাউন।",
          "arabic":
              "أَرَأَيْتَ الَّذِي يُكَذِّبُ بِالدِّينِ (১)\nفَذَلِكَ الَّذِي يَدُعُّ الْيَتِيمَ (২)\nوَلا يَحُضُّ عَلَى طَعَامِ الْمِسْكِينِ (৩)\nفَوَيْلٌ لِلْمُصَلِّينَ (৪)\nالَّذِينَ هُمْ عَنْ صَلاتِهِمْ سَاهُونَ (৫)\nالَّذِينَ هُمْ يُرَاءُونَ (৬)\nوَيَمْنَعُونَ الْمَاعُونَ (৭)",
          "meaning":
              "আপনি কি তাকে দেখেছেন যে বিচার দিবসকে অস্বীকার করে? সেই তো সে যে এতিমকে তাড়িয়ে দেয়। এবং মিসকিনকে অন্নদানে উৎসাহিত করে না। সুতরাং দুর্ভোগ সেসব নামাজির জন্য। যারা নিজেদের নামাজ সম্পর্কে গাফেল। যারা লোক দেখানোর জন্য কাজ করে। এবং নিত্যপ্রয়োজনীয় জিনিস দিতে নিষেধ করে।",
          "Fazilat": "",
          "ref": "সুরা আল-মাউন (Surah Al-Ma'un)",
          "target": "1"
        },
        {
          "title":
              "সুরা আন-নাসরঃ \nইজা জা-আ নাসরুল্লাহি ওয়াল ফাতহ্। \nওয়া রাইতান নাসা ইয়াদখুলুনা ফি দ্বীনিল্লাহি আফওয়াজা। \nফাসাব্বিহ বিহামদি রাব্বিকা ওয়াসতাগফিরহু ইন্নিহু কানা তাওয়াবা।",
          "arabic":
              "إِذَا جَاءَ نَصْرُ اللَّهِ وَالْفَتْحُ (১)\nوَرَأَيْتَ النَّاسَ يَدْخُلُونَ فِي دِينِ اللَّهِ أَفْوَاجًا (২) \nفَسَبِّحْ بِحَمْدِ رَبِّكَ وَاسْتَغْفِرْهُ إِنَّهُ كَانَ تَوَّابًا (৩)",
          "meaning":
              "যখন আসবে আল্লাহর সাহায্য ও বিজয়। এবং আপনি মানুষকে দলে দলে আল্লাহর দ্বীনে প্রবেশ করতে দেখবেন। তখন আপনি আপনার প্রতিপালকের প্রশংসার সাথে পবিত্রতা ঘোষণা করুন এবং ক্ষমা প্রার্থনা করুন; নিশ্চয়ই তিনি তওবা কবুলকারী।",
          "Fazilat": "",
          "ref": "সুরা আন-নাসর (Surah An-Nasr)",
          "target": "1"
        }
      ]
    },
    {
      "packageName": "নিরাপত্তা ও দুশ্চিন্তা মুক্তির জন্য দোয়া",
      "description":
          "পবিত্র কুরআনের সূরা তাওবাহ্-এর শেষ আয়াত (১২৯ নম্বর আয়াত)। নবীজি (সা.) বলেছেন, যে ব্যক্তি সকাল এবং সন্ধ্যায় এই দোয়াটি পাঠ করবে, আল্লাহ তার দুনিয়া ও আখিরাতের সমস্ত দুশ্চিন্তা ও প্রয়োজনের জন্য যথেষ্ট হয়ে যাবেন।",
      "dhikrs": [
        {
          "title":
              "হাসবিয়াল্লাহু লা ইলাহা ইল্লা হুয়া, আলাইহি তাওয়াক্কালতু ওয়া হুয়া রাব্বুল আরশিল আযীম।",
          "arabic":
              "حَسْبِيَ اللَّهُ لَا إِلَهَ إِلَّا هُوَ ۖ عَلَيْهِ تَوَكَّلْتُ ۖ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ",
          "meaning":
              "আমার জন্য আল্লাহই যথেষ্ট, তিনি ব্যতীত অন্য কোনো উপাস্য নেই। আমি তাঁরই ওপর ভরসা করি এবং তিনি মহা আরশের অধিপতি।",
          "Fazilat":
              "যে ব্যক্তি প্রতিদিন সকালে ৭ বার এবং সন্ধ্যায় ৭ বার এই দোয়াটি পাঠ করবে, তার দুনিয়া ও আখেরাতের সব সমস্যার জন্য আল্লাহ তাআলাই যথেষ্ট হবেন— চাই সে সত্য মনে করে বলুক বা না বলুক।",
          "ref": "[আবু দাউদ: ৫০৮১]",
          "target": "7"
        },
        {
          "title": "সালামুন কাওলাম মীর রাব্বির রাহীম।",
          "arabic": "سَلَامٌ قَوْلًا مِّن رَّبٍّ رَّحِيمٍ",
          "meaning":
          "পরম দয়ালু পালনকর্তার পক্ষ থেকে তাদেরকে বলা হবে 'সালাম' (শান্তি)।",
          "Fazilat":
          "অনেক বুজুর্গ আলেমের মতে, কঠিন বিপদের সময় বা শত্রুর ভয় থাকলে এই আয়াতটি বেশি বেশি পাঠ করলে আল্লাহর বিশেষ রহমত ও নিরাপত্তা পাওয়া যঅনেকে শারীরিক অসুস্থতা বা ব্যথার জায়গায় হাত রেখে এই আয়াতটি পাঠ করে ফুঁ দেওয়ার আমল করে থাকেন (ইনশাআল্লাহ)।ায়। ",
          "ref": "[সূরা ইয়াসিন-এর ৫৮ নম্বর আয়াত]",
          "target": "10"
        }
      ]
    },
    {
      "packageName": "পিতামাতার জন্য দোয়া",
      "description": "মা-বাবার জন্য রহমতের দোয়া",
      "dhikrs": [
        {
          "title": "রব্বির হামহুমা কামা রব্বায়ানি সগীরা।",
          "arabic": "رَّبِّ ارْحَمْهُمَا كَمَا رَبَّيَانِي صَغِيرًا",
          "meaning":
              "হে আমার প্রতিপালক! তাঁদের (বাবা-মা) প্রতি দয়া করুন, ঠিক যেভাবে তাঁরা শৈশবে আমাকে লালন-পালন করেছেন।",
          "Fazilat":
              "একজন মৃত বা জীবিত বাবা-মায়ের জন্য সন্তানের করা এই দোয়াটি আল্লাহর কাছে অত্যন্ত প্রিযহাদিস অনুযায়ী, মানুষ মারা যাওয়ার পর তার সব আমল বন্ধ হয়ে যায়, কিন্তু নেক সন্তানের দোয়া তার কবরে সওয়াব পৌঁছাতে থাকে।",
          "ref": "[সূরা বনী ইসরাঈল, আয়াত: ২৪]",
          "target": "3"
        },
        {
          "title":
              "রাব্বানাগ ফিরলী ওয়ালি ওয়ালিদাইয়্যা ওয়ালিল মু’মিনিনা ইয়াওমা ইয়াকুমুল হিসাব।",
          "arabic":
              "رَبَّنَا اغْفِرْ لِي وَلِوَالِدَيَّ وَلِلْمُؤْمِنِينَ يَوْمَ يَقُومُ الْحِسَابُ",
          "meaning":
              "হে আমাদের পালনকর্তা! আমাকে, আমার পিতা-মাতাকে এবং সকল মুমিনকে ক্ষমা করুন সেদিন, যেদিন হিসাব প্রতিষ্ঠিত হবে।",
          "Fazilat": "",
          "ref": "[সূরা ইব্রাহিম: ৪১]",
          "target": "3"
        },
        {
          "title":
              "রাব্বিগফিরলী ওয়ালি-ওয়ালিদাইয়্যা ওয়া লিমান দাখালা বাইতিয়া মু’মিনাও ওয়ালিল মু’মিনিনা ওয়াল মু’মিনাত; ওয়ালা তাযিদিয যলিমিনা ইল্লা তাবার।",
          "arabic":
              "رَّبِّ اغْفِرْ لِي وَلِوَالِدَيَّ وَلِمَن دَخَلَ بَيْتِيَ مُؤْمِنًا وَلِلْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ وَلَا تَزِدِ الظَّالِمِينَ إِلَّا تَبَارًا",
          "meaning":
              "হে আমার পালনকর্তা! আমাকে, আমার পিতা-মাতাকে, যারা ঈমানদার হয়ে আমার ঘরে প্রবেশ করেছে তাদেরকে এবং সমস্ত মুমিন পুরুষ ও মুমিন নারীকে ক্ষমা করুন। আর জালেমদের জন্য কেবল ধ্বংসই বৃদ্ধি করুন।",
          "Fazilat":
              "শুধু নিজের পরিবার নয়, বরং পৃথিবীর সমস্ত মুমিন নর-নারীর জন্য দোয়া করা হয়েছে। নবীজি (সা.) বলেছেন, যে ব্যক্তি মুমিনদের জন্য ক্ষমা প্রার্থনা করে, আল্লাহ তাকে প্রত্যেক মুমিনের বিনিময়ে একটি করে নেকি দান করেন।",
          "ref": "[সূরা নূহ-এর ২৮ নম্বর আয়াত]",
          "target": "7"
        }
      ]
    },
    {
      "packageName": "সূরা হাশরের শেষ তিন আয়াত",
      "description":
          "মাগরিব এবং ফজর নামাজের পর এই তিনটি আয়াত পাঠ করার বিশেষ ফজিলত হাদিসে বর্ণিত হয়েছে।",
      "dhikrs": [
        {
          "title":
              "হুওয়াল্লা-হুল্লাযী লা ইলা-হা ইল্লা হুওয়া, আ-লিমুল গাইবি ওয়াশ শাহা-দাতি হুওয়ার রাহমা-নুর রাহীম।\n\nহুওয়াল্লা-হুল্লাযী লা ইলা-হা ইল্লা হুওয়াল মালিকুল কুদ্দূসুস সালা-মুল মু'মিনুল মুহাইমিনুল আযীযুল জাব্বা-রুল মুতাকাব্বির; সুবহা-নাল্লা-হি আম্মা ইউশরিকূন।\n\nহুওয়াল্লা-হুল খা-লিকুল বা-রিউল মুসাওয়্যিরু লাহুল আসমা-উল হুসনা; ইউসাব্বিহু লাহূ মা ফিস সামা-ওয়া-তি ওয়াল আরদ্বি ওয়া হুওয়াল আযীযুল হাকীম।",
          "arabic":
              "\nهُوَ اللَّهُ الَّذِي لَا إِلَهَ إِلَّا هُوَ عَالِمُ الْغَيْبِ وَالشَّهَادَةِ هُوَ الرَّحْمَنُ الرَّحِيمُ \n\nهُوَ اللَّهُ الَّذِي لَا إِلَهَ إِلَّا هُوَ الْمَلِكُ الْقُدُّوسُ السَّلَامُ الْمُؤْمِنُ الْمُهَيْمِنُ الْعَزِيزُ الْجَبَّارُ الْمُتَكَبِّرُ سُبْحَانَ اللَّهِ عَمَّا يُشْرِكُونَ \n\nهُوَ اللَّهُ الْخَالِقُ الْبَارِئُ الْمُصَوِّرُ لَهُ الْأَسْمَاءُ الْحُسْنَى يُسَبِّحُ لَهُ مَا فِي السَّمَاوَاتِ وَالْأَرْضِ وَهُوَ الْعَزِيزُ الْحَكِيمُ ",
          "meaning":
              "তিনিই আল্লাহ, তিনি ব্যতীত কোনো উপাস্য নেই; তিনি দৃশ্য ও অদৃশ্যের পরিজ্ঞাতা, তিনি পরম দয়ালু, অসীম দাতা\n\nতিনিই আল্লাহ, তিনি ব্যতীত কোনো উপাস্য নেই; তিনিই একমাত্র মালিক, পবিত্র, শান্তিদানকারী, নিরাপত্তা দানকারী, রক্ষক, পরাক্রমশালী, মহিমান্বিত, অপ্রতিভ। তারা যাকে শরিক করে আল্লাহ তা থেকে পবিত্র।\n\nতিনিই আল্লাহ, যিনি স্রষ্টা, উদ্ভাবক ও রূপদানকারী; সকল উত্তম নাম তাঁরই। আকাশমন্ডলী ও পৃথিবীতে যা কিছু আছে, সবই তাঁর পবিত্রতা ঘোষণা করে। তিনি পরাক্রমশালী, প্রজ্ঞাময়।।",
          "Fazilat":
              "হাদিস শরিফে বর্ণিত আছে, যে ব্যক্তি সকালে বা সন্ধ্যায় ৩ বার আউযুবিল্লাহিস সামিউল আলীমি মিনাশ শাইতানির রাজীম পাঠ করে সূরা হাশরের শেষ ৩ আয়াত পাঠ করবে:\n\nআল্লাহ তাআলা তার জন্য ৭০,০০০ ফেরেশতা নিযুক্ত করবেন, যারা সন্ধ্যা পর্যন্ত (বা সকাল পর্যন্ত) তার জন্য রহমতের দোয়া করবে।\n\nঐদিন তার মৃত্যু হলে সে শহীদি মর্যাদা লাভ করবে।",
          "ref": "[তিরমিজি শরিফ]",
          "target": "3"
        }
      ]
    }
  ];
}
